[
	{
		"post_id": "170379677710",
		"label": "Engaging Another Person’s Story: Why It's Important and How To Do It",
		"featured": true,
		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960713",
		"created_at": "2023-05-02T00:00:00.000Z",
		"text": "Effective story engagement is not a magical skill that some people have and some people don’t. It can be learned. Today we give a preview of some of the principles and tactics of effective story engagement. If you want to learn more, consider joining us on Saturday, May 13, for a Zoom conference on How to Engage Another Person’s Story.",
		"img": "https://ssl-static.libsyn.com/p/assets/b/5/7/2/b5728889402853f0/The-Place-1400.png",
		"content": "<p>Effective story engagement is not a magical skill that some people have and some people don’t. It can be learned. Today we give a preview of some of the principles and tactics of effective story engagement. If you want to learn more, consider joining us on Saturday, May 13, for a Zoom conference on How to Engage Another Person’s Story. You can sign up <a href=\"“https://adamyoungcounseling.com/how-to-engage-another-persons-story/“\" rel=\"noopener noreferrer\" target=\"_blank\">here</a>.</p>",
		"audio": "https://traffic.libsyn.com/secure/theplacewefindourselves/How_to_Engage_Another_Persons_Story.mp3",
		"video": "",
		"url": "https://adamyoungcounseling.com/podcast/"
	},
	{
		"post_id": "170379677711",
		"label": "Redeeming Heartache: Trauma is Profound, Healing is Possible",

		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960710",
		"created_at": "2021-12-17T00:00:00.000Z",
		"text": "Part of what it means to be human is to suffer, but there’s a way to move through it that brings joy and goodness to both you and the world around you.” Dan Allender and Cathy Loerzel. We all endure trauma—either Big T or Little T. We all seek healing. Yet all too often, the defense mechanisms we constructed to survive trauma, now keep us constrained. Join us to consider: Who we are meant to become in the midst of our heartaches. That we’ve all been orphaned, estranged, and widowed due to trauma and loss. How we can bring goodness and joy to others as we move through pain. According to Dan, “Every one of us suffers, yet our suffering is never meant to be only ours—we’re meant to not only join our own transformation, but also in the privilege of being able to join in others’ transformations.” If you’re hurting, you’ll feel a balm of empathy in Dan and Cathy’s words. Please join us for a tender, loving, healing conversation.",
		"img": "https://storage.cloud.google.com/cathy-loerzel-img/Abstract-1.jpg",
		"content": "<p>\"Part of what it means to be human is to suffer, but there’s a way to move through it that brings joy and goodness to both you and the world around you.” <em>Dan Allender and Cathy Loerzel.</em></p><p><br></p><p>We all endure trauma—either Big T or Little T. We all seek healing. Yet all too often, the defense mechanisms we constructed to survive trauma, now keep us constrained. Join us to consider: Who we are meant to become in the midst of our heartaches. That we’ve all been orphaned, estranged, and widowed due to trauma and loss. How we can bring goodness and joy to others as we move through pain. According to Dan, “Every one of us suffers, yet our suffering is never meant to be only ours—we’re meant to not only join our own transformation, but also in the privilege of being able to join in others’ transformations.” If you’re hurting, you’ll feel a balm of empathy in Dan and Cathy’s words. Please join us for a tender, loving, healing conversation.</p>",
		"audio": "https://d3ctxlq1ktw2nl.cloudfront.net/staging/2021-11-17/be856193-f1a5-a580-5e6f-59ff641e5707.m4a",
		"video": "",
		"url": "https://podcasts.apple.com/us/podcast/love-life-with-dr-karin/id1183475201"
	},
	{
		"post_id": "170379677712",
		"label": "Which of the Six Types Are You? With Dan Allender and Cathy Loerzel",

		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960710",
		"created_at": "2021-10-26T00:00:00.000Z",
		"text": "This is another episode we would pay you to listen to if we could. Do you approach your friendships, your work, or the pain in your life more as the orphan, the stranger, or the widow? Don’t know what that means? We didn’t either until we read “Redeeming Heartache” and then talked with the brilliant psychologist, Dr. Dan Allender, and to our new wise friend, author and therapist Cathy Loerzel. Dan and Cathy helped us understand each of these approaches to the world, and invited us to live redeemed as a priest, prophet, or king and queen. Together we explore: What if I don’t think I’ve ever had trauma? Do I still need to do heart work? Why do I need to look back at my past? My present is hard enough. Why do I act this way in challenging situations? Join us?",
		"img": "https://lauriekrieg.com/wp-content/uploads/2021/10/ep-185_web.jpg",
		"content": "<h2>This is another episode we would pay you to listen to if we could.</h2><p>Do you approach your friendships, your work, or the pain in your life more as the orphan, the stranger, or the widow?</p><p>Don’t know what that means? We didn’t either until we read “Redeeming Heartache” and then talked with the brilliant psychologist, Dr. Dan Allender, and to our new wise friend, author and therapist Cathy Loerzel.</p><p>Dan and Cathy helped us understand each of these approaches to the world, and invited us to live redeemed as a priest, prophet, or king and queen.</p><p>Together we explore:</p><p>What if I don’t think I’ve ever had trauma? Do I still need to do heart work?</p><p>Why do I need to look back at my past? My present is hard enough.</p><p>Why do I act this way in challenging situations?</p><p>Join us?</p><h3>Highlights</h3><p>“To be able to rest and receive delight and have gratitude, you need to be able to be open to what other people can offer you…. So if you’re never in that place of being able to receive that with an open, trusting heart, then you’re always…coiled up and ready for the place that you’re gonna be harmed next. So it keeps you from being able to receive surprise and delight and play because you’re always, always, always looking around the corner.” -Cathy Loerzel</p><p>“The reality is we all bear some of the effects of the Fall, and that’s what we’re calling trauma.” -Dan Allender</p><p>“You can’t heal the present without going back to the past.” –Cathy Loerzel</p><h3>Do the Next Thing</h3><p>Want more of these two? Go read their book, <a href=\"https://www.amazon.com/Redeeming-Heartache-Suffering-Reveals-Calling/dp/0310362016\" rel=\"noopener noreferrer\" target=\"_blank\"><em>Redeeming Heartache</em></a>!</p><p>Check out the <a href=\"https://theallendercenter.org\" rel=\"noopener noreferrer\" target=\"_blank\">Allender Center</a>, which both Dan and Cathy are a part of founding and leading!</p><p>Dan is a veteran on the podcast! Here’s our <a href=\"https://lauriekrieg.com/podcast/sexuality-and-shame-with-dan-allender/\" rel=\"noopener noreferrer\" target=\"_blank\">first episode</a> with him.</p><p>Looking for a fresh way to read Scripture? The CSB translation is a sponsor of the HIMH podcast! Learn more about our new favorite Bible at <a href=\"http://csbible.com/\" rel=\"noopener noreferrer\" target=\"_blank\">csbible.com</a>.</p><p>Want something deeper than just the podcast? Join our <a href=\"https://www.facebook.com/groups/434827357279517\" rel=\"noopener noreferrer\" target=\"_blank\">Facebook group</a> and discuss with us!</p><p>Watch this conversation! (COMING SOON)</p>",
		"audio": "https://chtbl.com/track/289G57/http://feeds.soundcloud.com/stream/1146421963-laurie-krieg-episode-185-which-of-the-six-types-are-you-with-dan-allender-cathy-loerzel.mp3",
		"video": "",
		"url": "https://lauriekrieg.com/podcast/which-of-the-six-types-are-you-with-dan-allender-cathy-loerzel/"
	},
	{
		"post_id": "170379677713",
		"label": "Redeeming Heartache",

		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960710",
		"created_at": "2021-10-10T00:00:00.000Z",
		"text": "Does past heartache seem to dictate your present life? This week, Steve and the gang sit down with authors Dan Allender and Cathy Loerzel to discuss a new path toward healing.",
		"img": "https://i.ytimg.com/vi_webp/aI4-rhHhIpk/maxresdefault.webp",
		"content": "<p>Does past heartache seem to dictate your present life? This week, Steve and the gang sit down with authors Dan Allender and Cathy Loerzel to discuss a new path toward healing.</p>",
		"audio": "https://media.blubrry.com/sbetc/www.keylifemedia.com/sbetc/steve-brown-etc-podcast/sbe760-10112021.mp3",
		"video": "",
		"url": "https://www.keylife.org/programs/steve-brown-etc/dan-allender-cathy-loerzel-redeeming-heartache-steve-brown-etc/"
	},
	{
		"post_id": "170379677714",
		"label": "Redeeming Heartache with Dan Allender and Cathy Loerzel",

		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960710",
		"created_at": "2021-09-30T00:00:00.000Z",
		"text": "This week, Karrie talks with renowned Psychologist, Dr. Dan Allender, and trauma expert, Cathy Loerzel, MA about their new co-authored book, Redeeming Heartache. This book will help you recognize what trauma has formed your strengths, heal from trauma you have forgotten, and identify how your stories of suffering have set the trajectory of your calling. Throughout the book, Dan and Cathy walk you through the six types of harm and how they play out in your life and affect you and your relationships. This is an incredible book that takes you past heartache and allows you to see the goodness that can come from it!",
		"img": "https://s3-us-west-2.amazonaws.com/anchor-generated-image-bank/production/podcast_uploaded_nologo400/18648134/18648134-1634246018732-d715bb59e5203.jpg",
		"content": "<p>This week, Karrie talks with renowned Psychologist, Dr. Dan Allender, and trauma expert, Cathy Loerzel, MA about their new co-authored book, Redeeming Heartache. This book will help you recognize what trauma has formed your strengths, heal from trauma you have forgotten, and identify how your stories of suffering have set the trajectory of your calling. Throughout the book, Dan and Cathy walk you through the six types of harm and how they play out in your life and affect you and your relationships. This is an incredible book that takes you past heartache and allows you to see the goodness that can come from it!</p>",
		"audio": "https://static1.squarespace.com/static/573560022b8dde3d113518f3/t/6155f73a0409555a5e01c3b4/1633023856480/THP+-+Episode+46+-+9%3A28%3A21%2C+3.14+PM.mp3/original/THP+-+Episode+46+-+9%3A28%3A21%2C+3.14+PM.mp3",
		"video": "",
		"url": "https://www.karriegarcia.com/thehonestpod/2021/9/30/episode-46-redeeming-heartache-with-dan-allender-and-cathy-loerzel"
	},
	{
		"post_id": "170379677715",

		"label": "Living Centered While Acknowledging Our Painful Past",

		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960710",
		"created_at": "2021-09-20T00:00:00.000Z",
		"text": "Many of us have been told, \"Don't dwell in the past.\" But the truth about trauma is that if we don't acknowledge, name, and honor our past pain, it will negatively impact our emotional, mental, and even physical health.",
		"img": "https://images.squarespace-cdn.com/content/v1/600b16b6a0977a7a6a86af7c/1632084368573-5AU6N37PPABR1CFF1T2B/allenderd_portrait.png?format=1000w",
		"content": "<div><p class=\"\" style=\"white-space:pre-wrap;\">Many of us have been told, \"Don't dwell in the past.\" But the truth about trauma is that if we don't acknowledge, name, and honor our past pain, it will negatively impact our emotional, mental, and even physical health.&nbsp;</p><p class=\"\" style=\"white-space:pre-wrap;\"><br>On today's episode of the Living Centered Podcast, Lindsey and Mickenzie sat down with <strong>Dr. Dan Allender </strong>and <strong>Cathy Loerzel, MA</strong>, co-founders of the Allender Center in Seattle, to discuss their new book Redeeming Heartache and the power of engaging and examining the painful parts of our stories to find healing and redemption&nbsp;</p></div>",
		"audio": "https://traffic.libsyn.com/secure/livingcenteredpodcast/EP035_Dan_Allender_and_Cathy_Loerzel_V2.mp3",
		"video": "",
		"url": "https://www.livingcenteredpodcast.com/episodes/035"
	},
	{
		"post_id": "170379677716",

		"label": "Wisdom of the Collective Mother",

		"post_category_id": "1703796960640",
		"post_topic_id": "1703796960711",
		"created_at": "2021-09-13T00:00:00.000Z",
		"text": "These past 18 months have been hard. Hard on a personal level, hard on a professional level, and hard on a collective level. The pandemic has disconnected so many of us from the embodied wisdom of community, friendships, and relationships. We have needed to be physically removed for safety, but also we have been separated based on ideologies and deep skisms that have life and death seemingly attached to them. We are divided and skeptical and don’t know where to turn. The toll has been brutal and severe. Even more than we know at this point. We need care, wisdom, and direction as we navigate a complex, heartbreaking, and ever-changing world. We need wise elders and people who have come before us who can steady the ship and set a new course.",
		"img": "https://i0.wp.com/redtentliving.com/wp-content/uploads/2021/09/elmer-canas-hTrc3aG3OGY-unsplash-e1629743443998.jpg?fit=1100%2C733&ssl=1",
		"content": "<div class=\"entry-content container container-small clear\"> <p>These past 18 months have been hard. Hard on a personal level, hard on a professional level, and hard on a collective level. The pandemic has disconnected so many of us from the embodied wisdom of community, friendships, and relationships. We have needed to be physically removed for safety, but also we have been separated based on ideologies and deep skisms that have life and death seemingly attached to them. We are divided and skeptical and don&#8217;t know where to turn. The toll has been brutal and severe. Even more than we know at this point. We need care, wisdom, and direction as we navigate a complex, heartbreaking, and ever-changing world. We need wise elders and people who have come before us who can steady the ship and set a new course. <span id=\"more-15768\"></span></p> <p>For me, I found myself longing for a grandmother. A wise guide who would invite me into her home, make me tea, and teach me the art of making bread or a delicious berry pie. I longed for her to listen to my plight, my confusion, and my heartache and tell me how it was all going to be ok. I wanted her to remind me of who I am and who I could become. I longed for her to see my face, realize I was exhausted, take me to her spare bedroom, and invite me to rest while the bread baked. And while my fantasy was rich and lovely, I knew in my heart that no one was coming. There was no magical grandmother that could help me navigate this season of my life and I was alone. I was alone to read the books, glean the wisdom I needed, and try to decipher the code coming through my many screens and texts.</p> <p>But it was not working. I was desperate, and words on my own were not enough. Then this past winter, as much of my world was falling apart, I began the bold move of gathering with some women from my church. I had been isolated, in a deep season of turmoil and trauma, and needed a community of women who were committed to seeing the fullness of the world and would also place pillows under my body as I hit the bottom. We were each heartbroken in some way and left to navigate the season without a wise mother to guide us through. We were often wandering rudderless to make our own way. But as we met and talked, we realized that between all of our experiences of sorrow, grief, and heartache, there was one wise woman. <i>We </i>were the wise guide we needed.</p> <p>Collectively, we could hold each other and allow our pieces of wisdom to collide and become whole on behalf of each of us individually. There was enough to go around, and as our friendships progressed, we were able to hold dreams, hopes, calling, grief, fear, and combat curses against our body and souls.</p> <blockquote><p><em><strong>Together, we found the wise woman, and because it was not up to one of us individually, we were able to carry each other&#8217;s burden with ease and compassion. </strong></em></p></blockquote> <p>We were willing to help hold the complexity of who we were without either idealizing our circumstances or dismissing our pain. We were truth tellers and soul tenders, and in the end, I found myself literally being held up by their arms, floating in a pool, and grieving years of painful failure and loss.</p> <p>Together, they were strong enough to hold me, tender enough to wipe my tears, and loving enough to tell me I was good and also enough. It was the embodied wisdom and care I so deeply longed for, and it was utterly life changing. We were the wise woman, and instead of waiting for the non-existent rescuer to appear, we rose up and became what we all needed.</p> <p>Many of us are left desiring a singular person we can fully trust and drop into their wise arms and weep, but what if that which we desire is already here? What if it is not one person but all of us, together, that we really need? If that’s true, then we can be human sized, imperfect, broken, needy, and wise all at the same time. We don’t need to be heroic or all knowing, but we do need to be brave enough to risk presence and be available with whatever we can offer. If we can trust that those parts are enough, we can find a deep well of wisdom residing in the power of the women in our midst. We are the mothers we need; we are the wisdom that is born of suffering and loss. Together, we are enough.</p></div>",
		"audio": "",
		"video": "",
		"url": "https://redtentliving.com/2021/09/13/wisdom-of-the-collective-mother/"
	},
	{
		"post_id": "170379677717",

		"label": "Redeeming Heartache: How Past Suffering Reveals Our True Calling",

		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960710",
		"created_at": "2021-09-10T00:00:00.000Z",
		"text": "Cathy Loerzel and Dan Allender join me today to talk about their newly published book Redeeming Heartache: How Past Suffering Reveals Our True Calling. Cathy and Dan reflect on what redemption actually means in the context of our stories, why they believe redemption is possible, and how our experiences of being an orphan, a stranger, and a widow can shape our sense of personal calling. If you want to engage your story in more depth, consider signing up for The Story Workshop which will be held virtually from October 14-17. ",
		"img": "https://ssl-static.libsyn.com/p/assets/b/5/7/2/b5728889402853f0/The-Place-1400.png",
		"content": "<p>Cathy Loerzel and Dan Allender join me today to talk about their newly published book Redeeming Heartache: How Past Suffering Reveals Our True Calling. Cathy and Dan reflect on what redemption actually means in the context of our stories, why they believe redemption is possible, and how our experiences of being an orphan, a stranger, and a widow can shape our sense of personal calling. If you want to engage your story in more depth, consider signing up for The Story Workshop which will be held virtually from October 14-17.</p>",
		"audio": "https://hwcdn.libsyn.com/p/7/0/e/70e733ac325675b0/Redeeming_Heartache.mp3?c_id=111109364&cs_id=111109364&destination_id=684469&expiration=1638326009&hwt=cb524d27ef0c95cf77e10660b2fcd23e",
		"video": "",
		"url": "https://adamyoungcounseling.com/podcast/"
	},
	{
		"post_id": "170379677718",

		"label": "The Making of Redeeming Heartache",

		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960710",
		"created_at": "2021-09-10T00:00:00.000Z",
		"text": "What goes into the creation of a book? In this special episode, we take a deep dive into the making of Dr. Dan Allender and Cathy Loerzel’s new release, Redeeming Heartache: How Past Suffering Reveals True Calling. Special guest host Dr. J. Derek McNeil, President & Provost of The Seattle School, Dan, and Cathy discuss how the idea for the book came to be, the process and challenges of writing a book together, particularly in the midst of COVID, and the prophetic nature of the content. As they close the conversation, Derek poses a poignant question to Dan and Cathy—and to us all: What does it mean to celebrate our own stories?",
		"img": "https://cdn.theallendercenter.org/wp-content/uploads/2021/09/TAC-RH-Podcast.png",
		"content": "<div class=\"the-content\"> <p>What goes into the creation of a book? In this special episode, we take a deep dive into the making of Dr. Dan Allender and Cathy Loerzel’s new release, Redeeming Heartache: How Past Suffering Reveals True Calling. Special guest host Dr. J. Derek McNeil, President &amp; Provost of The Seattle School, Dan, and Cathy discuss how the idea for the book came to be, the process and challenges of writing a book together, particularly in the midst of COVID, and the prophetic nature of the content. As they close the conversation, Derek poses a poignant question to Dan and Cathy—and to us all: What does it mean to celebrate our own stories?</p> <h2>Listener Resources</h2> <ul> <li><a href=\"https://www.zondervan.com/p/redeeming-heartache/#preordernow\" target=\"_blank\" rel=\"noopener\">Pre-order your own copy of <em>Redeeming Heartache</em></a></li> <li><a href=\"https://theallendercenter.org/event/redeeming-heartache-online-event-2021/\" target=\"_blank\" rel=\"noopener\">Register for a one-day, online event</a> with Dan and Cathy on September 18 and learn how heartache of the past can become a springboard for a more hopeful future</li> </ul> </div>",
		"audio": "https://hwcdn.libsyn.com/p/5/6/1/56103767ba3089e0/TAC394_v1.mp3?c_id=111053573&cs_id=111053573&expiration=1638327382&hwt=81c199128b4fa2d6bfd88716f2432e5a",
		"video": "",
		"url": "https://theallendercenter.org/2021/09/making-redeeming-heartache/"
	},
	{
		"post_id": "170379677719",

		"label": "Redeeming Heartache and Trauma with Dan Allender and Cathy Loezel",

		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960710",
		"created_at": "2021-09-07T00:00:00.000Z",
		"text": "Have you ever found yourself asking, “Why did this happen to me?” When we listen to guests of this show, authors of bestselling books, or public speakers, one thing is clear: they have figured out that “why”. It seems so clear when they tell their stories. They usually seem to come full circle with the purpose or moral wrapped in a bow ready to be gifted to the world. Here’s what I’ve learned though: it’s very rare to find the meaning behind your own experiences if you don’t actively look for it. You have to do the work. So how do we navigate the emotions that we have over everything that’s happened to us, to find real meaning? How do we begin to release our pain to build strength? That’s what we’re talking about today. Our guests today are Dr. Dan Allender, professor of counseling psychology and founder of The Allender Center, and Cathy Loerzel, speaker, instructor, as well as cofounder and executive vice president of The Allender Center.",
		"img": "https://omny.fm/shows/mind-love-modern-mindfulness/image.jpg?t=1623779038&size=Small",
		"content": "<div> <p>Have you ever found yourself asking, “Why did this happen to me?”</p> <p>When we listen to guests of this show, authors of bestselling books, or public speakers, one thing is clear: they have figured out that “why”.</p> <p>It seems so clear when they tell their stories. They usually seem to come full circle with the purpose or moral wrapped in a bow ready to be gifted to the world.</p> <p>Here’s what I’ve learned though: it’s very rare to find the meaning behind your own experiences if you don’t actively look for it.</p> <p>You have to do the work.</p> <p>So how do we navigate the emotions that we have over everything that’s happened to us, to find real meaning? How do we begin to release our pain to build strength?</p> <p>That’s what we’re talking about today.</p> <p>Our guests today are Dr. Dan Allender, professor of counseling psychology and founder of The Allender Center, and Cathy Loerzel, speaker, instructor, as well as cofounder and executive vice president of The Allender Center.</p> <h3>We Will Learn</h3> <ul> <li style=\"font-weight: 400;\" aria-level=\"1\">How to become more self aware of the past trauma or pain that influencing your present.</li> <li style=\"font-weight: 400;\" aria-level=\"1\">How to identify the lies we tell ourselves so we can heal.</li> <li style=\"font-weight: 400;\" aria-level=\"1\">How to move through and release big emotions.</li> </ul> <h3>Links</h3> <ul> <li><a href=\"https://theallendercenter.org/\" target=\"_blank\" rel=\"noopener noreferrer\">The Allender Center</a></li> <li><a href=\"https://amzn.to/3B4X7Ut\" target=\"_blank\" rel=\"noopener noreferrer\">Redeeming Heartache: How Past Suffering Reveals Our True Calling</a></li> </ul> </div>",
		"audio": "https://chtbl.com/track/B7AB5D/chtbl.com/track/E199/pdst.fm/e/dts.podtrac.com/redirect.mp3/traffic.omny.fm/d/clips/9b7dacdf-a925-4f95-84dc-ac46003451ff/303a9b42-717f-42f0-9474-acc3000f06d8/00f5e61c-d5a4-4b3a-9965-ad9c00159fe7/audio.mp3",
		"video": "",
		"url": "https://www.mindlove.com/podcast/redeeming-heartache-trauma/"
	},
	{
		"post_id": "170379677720",

		"label": "How Story Work Can Heal the Heart",

		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960713",
		"created_at": "2021-07-04T00:00:00.000Z",
		"text": "Today we talk about Story Work from her upcoming book release with renowned psychologist Dr. Dan Allender called Redeeming Heartache: How Past Suffering Reveals Our True Calling. In my opinion, Cathy and Dr. Allender–along with The Allender Center colleagues–are the foremost thinkers regarding how your storied history ends up revealing the mysteries of undesirable emotional experiencing and behavior in the present.",
		"img": "https://i.ytimg.com/vi/IFZOYk0vh1M/maxresdefault.jpg",
		"content": "<p class=\"mt-5\">Today we talk about Story Work from her upcoming book release with renowned psychologist Dr. Dan Allender called Redeeming Heartache: How Past Suffering Reveals Our True Calling. In my opinion, Cathy and Dr. Allender–along with The Allender Center colleagues–are the foremost thinkers regarding how your storied history ends up revealing the mysteries of undesirable emotional experiencing and behavior in the present.</p>",
		"audio": "",
		"video": "https://youtu.be/IFZOYk0vh1M",
		"url": "https://www.redinkrevival.com/post/78-cathy-loerzel-how-story-work-can-heal-the-heart"
	},
	{
		"post_id": "170379677721",

		"label": "How To Engage Your Story In A Way That Brings Healing",

		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960713",
		"created_at": "2021-05-05T00:00:00.000Z",
		"text": "Cathy Loerzel joins me to talk about how to engage your family of origin story in a way that brings healing to your brain. We examine three byproducts of trauma (fragmentation, dissociation, and isolation), the importance of naming the intentionality of those who harmed you, the role you played in your family, and the U Diagram of healing. Cathy and I will be co-teaching the Engaging Your Story Conference on Saturday, June 12.",
		"img": "https://adamyoungcounseling.com/wp-content/uploads/2021/05/Season-5.png",
		"content": "<p class=\"mt-5\">Cathy Loerzel joins me to talk about how to engage your family of origin story in a way that brings healing to your brain. We examine three byproducts of trauma (fragmentation, dissociation, and isolation), the importance of naming the intentionality of those who harmed you, the role you played in your family, and the U Diagram of healing. Cathy and I will be co-teaching the Engaging Your Story Conference on Saturday, June 12. You can register <a href=\"https://adamyoungcounseling.com/engaging-your-story-workshop/\">here</a>.</p>",
		"audio": "https://traffic.libsyn.com/secure/theplacewefindourselves/Engaging_Your_Story.mp3",
		"video": "",
		"url": "https://adamyoungcounseling.com/2021/05/05/how-to-engage-your-story-in-a-way-that-brings-healing/"
	},
	{
		"post_id": "170379677722",

		"label": "Connection in Relationships",

		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960713",
		"created_at": "2021-02-26T00:00:00.000Z",
		"text": "Picking up their conversation from last week, Dan and Cathy turn their attention to uncovering the roots of conflict in relationships and how we can move towards true connection. Oftentimes conflict arises because we cannot name what we truly need, or we cannot see past our own contempt—ultimately there is something keeping us from seeing the other well. Redemption is possible, but we must be willing to engage our conflict in a way we’ve not experienced before.",
		"img": "https://cdn.theallendercenter.org/wp-content/uploads/2021/02/Conflict-Connection-Podcast-imageop7-1536x864.jpg",
		"content": "<div class=\"the-content\"><p>Picking up their <a href=\"https://theallendercenter.org/2021/02/conflict-relationships/\" target=\"_blank\" rel=\"noopener\">conversation from last week</a>, Dan and Cathy turn their attention to uncovering the roots of conflict in relationships and how we can move towards true connection. Oftentimes conflict arises because we cannot name what we truly need, or we cannot see past our own contempt—ultimately there is something keeping us from seeing the other well. Redemption is possible, but we must be willing to engage our conflict in a way we’ve not experienced before.</p><h2>Listener Resources</h2><ul><li>Purchase access to the recording of the one-day conference “<a href=\"https://courses.theallendercenter.org/p/virtual-marriage-conference-from-conflict-to-connection\" target=\"_blank\" rel=\"noopener\">From Conflict to Connection: A Conference for Couples</a>”</li><li>Listen to a podcast that introduces the archetypes of orphan, widow, and stranger: “<a href=\"https://theallendercenter.org/2020/10/calling-character-prophet-priest-king/\" target=\"_blank\" rel=\"noopener\">Calling and Character: Prophet, Priest, King</a>”</li><li>Listen to a podcast episode titled “<a href=\"https://theallendercenter.org/2020/02/reconnection-marriage-rerelease/\" target=\"_blank\" rel=\"noopener\">Reconnection in Marriage with Dr. Dan Allender and Dr. Steve Call</a>”</li></ul></div>",
		"audio": "https://traffic.libsyn.com/secure/theallendercenter/TAC325-ConflictConnection2-v1.mp3",
		"video": "",
		"url": "https://theallendercenter.org/2021/02/connection-relationships/"
	},
	{
		"post_id": "170379677723",

		"label": "Conflict in Relationships",

		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960713",
		"created_at": "2021-02-19T00:00:00.000Z",
		"text": "There is no doubt that we are living in a time that heightens levels of conflict and contention in our relationships. Having just finished a one-day conference on this topic, Dr. Dan Allender and Cathy Loerzel talk today on the podcast about their recent, personal experiences with conflict, particularly in this pandemic era. In this season, the ways we engage and relate to conflict look different. You’ll hear Dan and Cathy talk about the reality of this conflict, what we can learn from our styles of relating in conflict, and how, underneath it all, is a deep-seated war with desire.",
		"img": "https://cdn.theallendercenter.org/wp-content/uploads/2021/02/etienne-boulanger-erCPgyXNlto-unsplash-1536x1025.jpg",
		"content": "<div class=\"the-content\"><p>There is no doubt that we are living in a time that heightens levels of conflict and contention in our relationships. Having just finished a one-day conference on this topic, Dr. Dan Allender and Cathy Loerzel talk today on the podcast about their recent, personal experiences with conflict, particularly in this pandemic era. In this season, the ways we engage and relate to conflict look different. You’ll hear Dan and Cathy talk about the reality of this conflict, what we can learn from our styles of relating in conflict, and how, underneath it all, is a deep-seated war with desire.</p><h2>Listener Resources</h2><ul><li>Purchase access to the recording of the one-day conference “<a href=\"https://courses.theallendercenter.org/p/virtual-marriage-conference-from-conflict-to-connection\" target=\"_blank\" rel=\"noopener\">From Conflict to Connection: A Conference for Couples</a>”</li><li>Listen to a podcast episode on “<a href=\"https://theallendercenter.org/2020/09/the-reality-of-marriage-in-covid-19/\" target=\"_blank\" rel=\"noopener\">The Reality of Marriage in COVID-19</a>”</li><li>Read a blog post by Jay Stringer on “<a href=\"https://theallendercenter.org/2020/04/good-enough-parenting-crisis/\" target=\"_blank\" rel=\"noopener\">Good Enough Parenting in a Time of Crisis</a>”</li></ul></div>",
		"audio": "https://traffic.libsyn.com/secure/theallendercenter/TAC324-ConflictConnection1-v1.mp3",
		"video": "",
		"url": "https://theallendercenter.org/2021/02/conflict-relationships/"
	},
	{
		"post_id": "170379677724",

		"label": "What Is Story Work?",

		"post_category_id": "1703796960642",
		"post_topic_id": "1703796960713",
		"created_at": "2020-10-30T00:00:00.000Z",
		"text": "Cathy answers the question: What is story work?",
		"img": "https://storage.cloud.google.com/cathy-loerzel/Images/cathy-square.jpg",
		"content": "",
		"audio": "",
		"video": "https://vimeo.com/607537276/d1dde7904c",
		"url": "https://vimeo.com/607537276/d1dde7904c"
	},
	{
		"post_id": "170379677725",

		"label": "Why Do We Need Story Work?",

		"post_category_id": "1703796960642",
		"post_topic_id": "1703796960713",
		"created_at": "2020-10-30T00:00:00.000Z",
		"text": "Cathy answers the questions: Why do we need story work?",
		"img": "https://storage.cloud.google.com/cathy-loerzel/Images/cathy-square.jpg",
		"content": "",
		"audio": "",
		"video": "https://vimeo.com/607537220/3828b87d6b",
		"url": "https://vimeo.com/607537220/3828b87d6b"
	},
	{
		"post_id": "170379677726",

		"label": "What Is The U Diagram?",

		"post_category_id": "1703796960642",
		"post_topic_id": "1703796960710",
		"created_at": "2020-10-30T00:00:00.000Z",
		"text": "Cathy describes the U-Diagram and its importance.",
		"img": "https://storage.cloud.google.com/cathy-loerzel/Images/cathy-square.jpg",
		"content": "",
		"audio": "",
		"video": "https://vimeo.com/607537347/048e04c19a",
		"url": "https://vimeo.com/607537347/048e04c19a"
	},
	{
		"post_id": "170379677727",

		"label": "Calling & Character: Queen and King Archetype",

		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960710",
		"created_at": "2020-10-30T00:00:00.000Z",
		"text": "In their final conversation about archetypes within the kingdom of God, Dan, Cathy, and Rachael unpack what it means to be a widow or widower, and how one can become a thriving king or queen. What are the wounds that impact a king or queen, what does true leadership look like, and how does a king or queen bring order to God’s kingdom?",
		"img": "https://cdn.theallendercenter.org/wp-content/uploads/2020/10/ashton-mullins-j1HU-Oll7KI-unsplash-1-1536x1017.jpg",
		"content": "<div class=\"the-content\"><p>In their final conversation about <a href=\"http://theallendercenter.org/2020/10/calling-character-prophet-priest-king/\" target=\"_blank\" rel=\"noopener noreferrer\">archetypes within the kingdom of God</a>, Dan, Cathy, and Rachael unpack what it means to be a widow or widower, and how one can become a thriving king or queen. What are the wounds that impact a king or queen, what does true leadership look like, and how does a king or queen bring order to God’s kingdom?</p><h2>Quotes</h2><p>“There is something about being bereft in the middle of some level of significant loss of love that is so crucial for a king/queen to be able to hold and move into. This has been a horrendous time with so many losses, so much complexity, not only culturally but in terms of families.” <strong>Dr. Dan Allender</strong></p><p>“The widowed heart can either move to a kind of “I just won’t have desire, pleasure, I’ll cut off this capacity and therefore be free to rule and reign unencumbered,” or it can lead to an indulgence in pleasure that keeps the heart from the love we’re most meant for.” <strong>Rachael Clinton Chen</strong></p><p>“The queen category is a primary place of comfortability for me. A lot of the work I do is creating boundaries, figuring out systems or order that needs to be in place for things to come to be, and more than anything I find myself being the one who can look at a problem and say “Ok, we can figure out a way through and these are the five steps and this is how we’re going to go and everyone get on board and let’s do it.” <strong>Cathy Loerzel</strong></p><p>“When I think about kings/queens I think about lovers, imagining a world where flourishing is the status quo, where we are living in the ways we are most meant to, so the category of widow/widower makes sense as some of the core woundings because there is a sense of knowing you are made for love and knowing there is a way you can create a world where love flourishes, where there’s a mutual giving and receiving of pleasure, where justice and mercy reign supreme without effort on behalf of all, so on a very grand scale you’re constantly working in the midst of chaos and brokenness to bring about these realities.” <strong>Rachael Clinton Chen</strong></p><p>“When the king or queen is as you would wish for them to be on your behalf, there’s nothing greater, but the moment that decisions, directions get taken that are not in accord, there’s no position more vilified than a king or queen who is not doing what we, the people, the community, desires.” <strong>Dr. Dan Allender</strong></p><p>“The weight is intense and it needs to be intense because what you’re called to manage is public, typically it has a lot of consequence and you’re asked to make very difficult decisions that are not necessarily going to be popular but they are the wisest decision that you could make in the moment. And when you do make them, you also need to be the first to own your failure. So there is a tremendous amount of weight that comes from this station of being a king or a queen.” <strong>Cathy Loerzel</strong></p><p>“To be truly, even if its a misused term, a true servant leader who knows what it is to be at the table rather than sitting at the table is a rare leader and requires a lot of death— to self, to dreams, and power, in order to utilize power in a way that brings honor and goodness.” <strong>Dr. Dan Allender</strong></p><p>“We’re building a structure that allows for flourishing, mutuality, voices to be at the table, which also allows for significant parts of the leadership community to be filled by prophets, priests, and other kings and queens and allow the fullness of the table to be set so we can all move together for the glory of God and be able to honor what we bring to the table, not diminish it, not decrease it because it is collective, it’s a community.” <strong>Cathy Loerzel</strong></p><h2>Resources</h2><ul><li>Listen to a podcast series with Cathy and Dan about “<a href=\"https://theallendercenter.org/category/podcast/complexities-in-leadership/\" target=\"_blank\" rel=\"noopener noreferrer\">Complexities in Leadership</a>”</li><li>Listen to a podcast series with Rachael and Dan about “<a href=\"https://theallendercenter.org/category/podcast/binds-of-leadership/\" target=\"_blank\" rel=\"noopener noreferrer\">The Binds of Leadership</a>”</li><li>Read a blog post by Danielle Castillejo about leaders and “<a href=\"https://theallendercenter.org/2019/10/fighting-eye-needle/\" target=\"_blank\" rel=\"noopener noreferrer\">Fighting Through the Eye of the Needle</a>”</li></ul></div>",
		"audio": "https://traffic.libsyn.com/secure/theallendercenter/TAC307-PriestProphetKing4-v1.mp3",
		"video": "",
		"url": "https://theallendercenter.org/2020/10/calling-character-queen-king/"
	},
	{
		"post_id": "170379677728",

		"label": "Calling & Character: Prophet Archetype",

		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960710",
		"created_at": "2020-10-23T00:00:00.000Z",
		"text": "Continuing a conversation about what it means to live out the character of God in the context of the kingdom of God, Dan, Cathy, and Rachael engage the archetypes of stranger and prophet. You’ll hear more about what it means to be a stranger who, in the redemptive process, can begin to use their sense of alienation and isolation on behalf of the kingdom as a prophet. As Dan notes, in our world today we desperately need to listen to prophets who tell the truth, and open the door to imagination and redemptive hope.",
		"img": "https://cdn.theallendercenter.org/wp-content/uploads/2020/10/BlogFI-ProphetStranger.jpg",
		"content": "<div class=\"the-content\"><p>Continuing a conversation about what it means to live out the <a href=\"http://theallendercenter.org/2020/10/calling-character-prophet-priest-king/\" target=\"_blank\" rel=\"noopener noreferrer\">character of God</a> in the context of the kingdom of God, Dan, Cathy, and Rachael engage the <a href=\"http://theallendercenter.org/2020/10/priest-archetype/\" target=\"_blank\" rel=\"noopener noreferrer\">archetypes</a> of stranger and prophet. You’ll hear more about what it means to be a stranger who, in the redemptive process, can begin to use their sense of alienation and isolation on behalf of the kingdom as a prophet. As Dan notes, in our world today we desperately need to listen to prophets who tell the truth, and open the door to imagination and redemptive hope.</p><h2>Quotes</h2><p>“There’s something about the nature of our brokenness that becomes the soil for being able to grow the fruitfulness of being a priest, prophet, and king or queen.”<strong> Dr. Dan Allender</strong></p><p>“A prophet is meant to show us what is possible, to reveal something of where things are broken and help offer an opportunity to what should be.” <strong>Cathy Loerzel</strong></p><p>“I think the prophets in our world are the artists and the dreamers and those who imagine with radical hope and can see and taste something of the kingdom of God we are meant for in the here and now, not just someday.” <strong>Rachael Clinton Chen</strong></p><p>“What we do with the truth-tellers in our midst says a lot about who we are, and I think to listen to the prophet means exposure, means learning something about our heart, about the parts of ourselves we don’t want to know—we have to allow those things to come to bear.” <strong>Cathy Loerzel</strong></p><p>“Oftentimes the prophet in the family system may not be a truth teller in what they say but their body might be telling the truth in what it&#8217;s bearing of the family’s darkness that’s not being engaged.” <strong>Rachael Clinton Chen</strong></p><p>“It is our responsibility as prophetic presences to invite people to look at what you do to a child who disrupts you, let alone huge protest movements that are calling forth for something to be addressed with regard to a long, unaddressed history of isolation and harm.” <strong>Dr. Dan Allender</strong></p><p>“We’re in a moment right now where something needs to be dismantled, not for destruction, but for the sake of human flourishing. People are crying out ‘I am dying, and I need something to change.’” <strong>Rachael Clinton Chen</strong></p><p>“That is the power of the prophet, and as the stranger is tended to, because a part of what you have to tend to with the stranger is a sense of yes, you left and you rejected the world that’s rejected you, but the reality is you’re sad about it because you love it and you see something of its future in your body. You see what’s possible and therefore the grief and the rage that comes alongside seeing people not rise to the occasion or dismissing what you&#8217;re seeing is heartbreaking. So the stranger is really just heartbroken, because they have seen the people they have loved not rise to the occasion.” <strong>Cathy Loerzel</strong></p><p>“Can you tend to the place that you have known deep agony and suffering the disappointment of a broken world and can you find the communities who sing the songs of lament with you and who dream dreams with you?” <strong>Rachael Clinton Chen</strong></p><h2>Resources</h2><ul><li>Listen to a podcast series with Dan about <a href=\"https://theallendercenter.org/category/podcast/scapegoating/\" target=\"_blank\" rel=\"noopener noreferrer\">Scapegoating</a></li><li>Read a blog post by Gabes Torres entitled “<a href=\"https://theallendercenter.org/2019/10/racial-inequity/\" target=\"_blank\" rel=\"noopener noreferrer\">Racial Inequality and Inequity: An Ongoing Lament</a>”</li><li>Listen to a podcast episode with Dan and Dr. Keith Anderson about “<a href=\"https://theallendercenter.org/2016/06/hidden-hope-lament/\" target=\"_blank\" rel=\"noopener noreferrer\">The Hidden Hope in Lament</a>”</li></ul></div>",
		"audio": "https://traffic.libsyn.com/secure/theallendercenter/TAC307-PriestProphetKing3-v2.mp3",
		"video": "",
		"url": "https://theallendercenter.org/2020/10/calling-character-prophet-archetype/"
	},
	{
		"post_id": "170379677729",

		"label": "Calling & Character: Priest Archetype",

		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960710",
		"created_at": "2020-10-16T00:00:00.000Z",
		"text": "This week, Dan, Rachael, and Cathy take a deep dive into and further reflect on the archetype of priest. What is required for a priest to grow in their ability to do what priests are meant to do? In this episode, you’ll hear our hosts and Cathy talk about the importance of archetypal thinking, how the archetype of an “orphan” relates to the calling of a priest archetype, and the process by which an orphan is transformed.",
		"img": "https://cdn.theallendercenter.org/wp-content/uploads/2020/10/OrphanPriest-BlogFI.jpg",
		"content": "<div class=\"the-content\"><p>This week, Dan, Rachael, and Cathy take a deep dive into and further reflect on the archetype of priest. What is required for a priest to grow in their ability to do what priests are meant to do? In this episode, you’ll hear our hosts and Cathy talk about the importance of archetypal thinking, how the archetype of an “orphan” relates to the calling of a priest archetype, and the process by which an orphan is transformed.</p><h2>Quotes</h2><p>“The power of story, the power of character is that they reveal something about ourselves or us that helps us further connect to both our journey and the journey that we have with God and with each other.” <strong>Cathy Loerzel</strong></p><p>“We don’t want people just to be so-called healed from trauma, though we do, we also want people to enter into trauma to see the character that you are growing in your ability to live out the kingdom.” <strong>Dr. Dan Allender</strong></p><p>“The core of orphan is that they had a sense of what the world should be, they had a sense that they should be cared for, safe, have rest, be able to trust their world, and that has been taken away. That can either happen through small things over time or large, cataclysmic events.” <strong>Cathy Loerzel</strong></p><p>“I think in some ways I thought I was a really good priest, but I was actually functioning more as an orphan because there was something I needed to grow in a capacity for honor, autonomy, personhood, and trust—a reconnection to community that allows you to serve people and hold the complexity of joy and sorrow, which is in some ways what a priest gets to offer the people.” <strong>Rachael Clinton Chen</strong></p><p>“A priest will call you back to gratitude and lament, and both are interwoven into the story of humanity, but the priest can hold both. So, I think what happens is the orphan, who is trying has instincts towards the priest but hasn’t actually grieved their own story, will only want to remember the goodness. A priest who still has a very active orphan will be the one who only wants to tell the good stories.” <strong>Cathy Loerzel</strong></p><p>“To bear stories and to be a storyteller is such a profound privilege because it&#8217;s also a part of identifying yourself, too. When these wounded parts of us experience healing they give us back parts of ourselves as we live into these ways of being in the midst of the kingdom that we’re called to, there is a restoration that happens.” <strong>Rachael Clinton Chen</strong></p><h2>Resources</h2><ul><li>We are in a wild, rapidly changing season. You may find yourself resonating with Dan and Rachael’s conversation from a few years back about “<a href=\"https://theallendercenter.org/2019/03/not-doing-well-1/\" target=\"_blank\" rel=\"noopener noreferrer\">Not Doing Well</a>.”</li><li>Listen to a podcast episode with Dan that engages the categories of prophet, priest, and king/queen titled “<a href=\"https://theallendercenter.org/2015/03/trauma-and-the-church/\" target=\"_blank\" rel=\"noopener noreferrer\">Trauma and the Church</a>.”</li><li>Listen to the first episode in this series, &#8220;<a href=\"http://theallendercenter.org/2020/10/calling-character-prophet-priest-king/\" target=\"_blank\" rel=\"noopener noreferrer\">Character and Calling: Prophet, Priest, King</a>.&#8221;</li></ul></div>",
		"audio": "https://traffic.libsyn.com/secure/theallendercenter/TAC306-PriestProphetKing2-v_2.mp3",
		"video": "",
		"url": "https://theallendercenter.org/2020/10/priest-archetype/"
	},
	{
		"post_id": "170379677730",

		"label": "Calling & Character: Prophet, Priest, King",

		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960710",
		"created_at": "2020-10-09T00:00:00.000Z",
		"text": "In this episode of the podcast, Dan and Rachael are joined by Cathy Loerzel, Executive Vice President of The Allender Center, to begin a conversation about a particular aspect of The Allender Theory: prophet, priest, and king/queen. During the conversation, they invite you into each of these three categories and to consider what it means to have been given a kingdom in which you are a priest, prophet, and king/queen.",
		"img": "https://cdn.theallendercenter.org/wp-content/uploads/2020/10/TACPodcast-Kingdom-BlogFI.jpg",
		"content": "<div class=\"the-content\"><p>In this episode of the podcast, Dan and Rachael are joined by Cathy Loerzel, Executive Vice President of The Allender Center, to begin a conversation about a particular aspect of The Allender Theory: prophet, priest, and king/queen. During the conversation, they invite you into each of these three categories and to consider what it means to have been given a kingdom in which you are a priest, prophet, and king/queen.</p><h2>Quotes</h2><p>“There’s a balance between understanding what we are called to and what we are meant to take care of, versus a sense of what we are meant to rule. I think the sense of the kingdom is really the question of: What are you called to steward in your lifetime?” <strong>Cathy Loerzel</strong></p><p>“Every person who follows Jesus has been given a kingdom that is meant to be linked to the kingdom of God—it is where we get to grow human flourishing and to invite people into the larger kingdom of God.” <strong>Dr. Dan Allender</strong></p><p>“How does our personhood and our gifting and our locatedness help us have a sense of Micah 6:8—what does it mean to do justice, to love mercy, and how much humility in walking humbly with God it takes, which contends with any false notion of having a kingdom means to rule.” <strong>Rachael Clinton Chen</strong></p><p>“When I think of a kingdom I think small, the particular, and the large. I think when we start to think about it in that way God immediately gave Adam and Eve dominion over the world, but what I think God meant was a sense of look around out and figure out how to help. How can you help the world flourish?” <strong>Cathy Loerzel</strong></p><p>“We stand against all forms of indignity, all things that cause human flourishing to be impossible or far more difficult than it should be. In that sense, we deal individually, systemically, and with larger categories of saying we stand against evil and all its forms, so that’s part of the question that I love asking people. What does your kingdom stand against? What is it opposed to?” <strong>Dr. Dan Allender</strong></p><p>“I start to think through how my stories of both delight and goodness and joy but also my stories of harm and heartache have shaped my particular bent around what I’m willing to fight for, what I’m willing to fight to make right in the world and fight to put down and say absolutely no.” <strong>Cathy Loerzel</strong></p><p>“I say ‘hell no’ to the places where religious authorities, those who speak and claim to speak for God, bring all kind of violence and harm and fragmentation to the people of God and to those who do not know God, and my ‘heaven’ yes is a sense of what it looks like to get in the pit with people and to say I don’t think that’s God, and I’m wondering if we can sit together and actually wait for God to birth you anew because that birthing process is God’s work and He delights in that work.” <strong>Rachael Clinton Chen</strong></p><p>“I think I’ve built my whole kingdom out of that framework: I want to be a person and a place where belief can be acknowledged with freedom and unbelief can be acknowledged without shame or accusation, and that was prior to me naming that I have a history of past sexual abuse, but even there it is exposure of deceit, what is seen, but not addressed.” <strong>Dr. Dan Allender</strong></p><p><em>Over the next few weeks Dan, Cathy, and Rachael will be spending more time in each of these three offices and how they come to be.</em></p><h2>Resources</h2><ul><li>Listen to a podcast series with Cathy Loerzel about “<a href=\"https://theallendercenter.org/category/podcast/complexities-in-leadership/\" target=\"_blank\" rel=\"noopener noreferrer\">The Complexities in Leadership</a>”</li><li>Listen to Dan and Rachael talk about “<a href=\"https://theallendercenter.org/2020/08/the-particulars-of-spiritual-abuse-mind-control-and-loyalty/\" target=\"_blank\" rel=\"noopener noreferrer\">The Particulars of Spiritual Abuse</a>” on the podcast</li></ul></div>",
		"audio": "https://traffic.libsyn.com/secure/theallendercenter/TAC305-PriestProphetKing1-v2.mp3",
		"video": "",
		"url": "https://theallendercenter.org/2020/10/calling-character-prophet-priest-king/"
	},
	{
		"post_id": "170379677731",

		"label": "Warfare Part 9: Soul Ties",

		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960714",
		"created_at": "2020-03-15T00:00:00.000Z",
		"text": "Season 3 concludes with the final episode on Warfare. I am joined again by Cathy Loerzel to talk about soul ties—what they are and how they are formed. In the previous episode we looked at how curses lead to agreements which lead to vows. Today, we look at how this progression can result in a soul tie with the person who has harmed us. In today’s episode, we also address how to break curses, agreements, vows, and soul ties.",
		"img": "https://adamyoungcounseling.com/wp-content/uploads/2020/03/Season-3-Episode-Art-795-X-500-1.png",
		"content": "<p>Season 3 concludes with the final episode on Warfare. I am joined again by Cathy Loerzel to talk about soul ties—what they are and how they are formed. In the previous episode we looked at how curses lead to agreements which lead to vows. Today, we look at how this progression can result in a soul tie with the person who has harmed us. In today&#8217;s episode, we also address how to <i>break</i> curses, agreements, vows, and soul ties.</p>",
		"audio": "http://traffic.libsyn.com/theplacewefindourselves/Cathy_Loerzel_Soul_Ties.mp3",
		"video": "",
		"url": "https://adamyoungcounseling.com/2020/03/15/warfare-part-9-soul-ties/"
	},
	{
		"post_id": "170379677732",

		"label": "Warfare Part 8: Curses, Agreements, and Vows",

		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960714",
		"created_at": "2020-03-03T00:00:00.000Z",
		"text": "I am joined by Cathy Loerzel to talk about curses, agreements, and vows—what they are, how they come to be, and where to find them in our stories. Cathy articulates the difference between a curse, an agreement, and a vow. She also explains how it is the design of evil for a curse to lead to an agreement, which then leads to a vow.",
		"img": "https://adamyoungcounseling.com/wp-content/uploads/2020/03/Season-3-Episode-Art-795-X-500.png",
		"content": "<p>I am joined by Cathy Loerzel to talk about curses, agreements, and vows—what they are, how they come to be, and where to find them in our stories. Cathy articulates the difference between a curse, an agreement, and a vow. She also explains how it is the design of evil for a curse to lead to an agreement, which then leads to a vow.</p>",
		"audio": "http://traffic.libsyn.com/theplacewefindourselves/Warfare_Part_8.mp3",
		"video": "",
		"url": "https://adamyoungcounseling.com/2020/03/03/warfare-part-8-curses-agreements-and-vows/"
	},
	{
		"post_id": "170379677733",

		"label": "What Women Wish Women Knew about Women’s Sexuality",

		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960712",
		"created_at": "2020-02-06T00:00:00.000Z",
		"text": "Rachael Clinton Chen leads an open and honest conversation with Cathy Loerzel and Christy Bauman about what they wish other women knew about women’s sexuality.",
		"img": "https://cdn.theallendercenter.org/wp-content/uploads/2020/02/Womens_sexuality2.jpg",
		"content": "<div class=\"the-content\"><p>Rachael Clinton Chen leads an open and honest conversation with Cathy Loerzel and Christy Bauman about what they wish other women knew about women’s sexuality.</p><p>One of the first questions Rachael asks that continues as a theme throughout this discussion is about the myths they believe need to be unpacked in regards to women’s sexuality.</p><p>Christy responds with conviction that women’s bodies are an invitation to the divine. She desires for women to know that their bodies are good, that their arousal cycles and body were created with intention.</p><p><strong>Christy:</strong> What does it mean to be curious about what is happening in our bodies and what we’re feeling and experiencing and what is it inviting us to?</p><p>Cathy responds by discussing the myth that women’s bodies aren’t meant for pleasure, or for our own pleasure, and relates a personal experience as an example.</p><p>In terms of what she wishes happened more often and that she had herself, Rachael brings up the need for more open and honest conversations for adolescents around the topic of women’s sexuality. Oftentimes this period of time is surrounded by much shame and isolation as young women learn what it means to be a sexual being.</p><p><strong>Cathy:</strong> How do we tend to those parts of ourselves so there can be a continuous awakening so that we can be in our bodies in a way that we don’t feel shame or contempt?</p><p><strong>Rachael:</strong> There is something about our sexuality that is meant to bear the image of God, that is meant to be a prayer, and is deeply connected to our capacity for hope. I think as women we do need to cultivate more spaces where we can come together and talk honestly about our struggles.</p><p>Rachael, Cathy, and Christy also have an important discussion around the reality of a woman’s body, including the scars often kept hidden—even from themselves. They talk about needing to step into these places with hope, reverence, and love to acknowledge the reality of living in a broken, beautiful, wounded, and good body.</p><p>To close, each share their final hopes for women as they begin to step into these spaces of fighting for goodness, for connecting the spirit of God to their sexuality, and for taking the risk to want and desire a different kind of intimacy, blessing, and prayer.</p><h2>Resources</h2><p><a href=\"https://www.amazon.com/Theology-Womb-Knowing-through-Woman/dp/1532662173\" target=\"_blank\" rel=\"noopener noreferrer\"><em>Theology of the Womb</em></a>, by Christy Bauman</p><p><a href=\"https://theallendercenter.org/2020/01/womens-sexuality-1/\" target=\"_blank\" rel=\"noopener noreferrer\">What Women Wish Men Knew about Women’s Sexuality</a></p><p><a href=\"https://theallendercenter.org/2019/11/men-women-sexuality/\" target=\"_blank\" rel=\"noopener noreferrer\">What Men Wish Women Knew about Men’s Sexuality</a></p><p><a href=\"https://theallendercenter.org/2019/10/men-sexuality/\" target=\"_blank\" rel=\"noopener noreferrer\">What Men Wish Men Knew about Men’s Sexuality</a></p></div>",
		"audio": "http://traffic.libsyn.com/theallendercenter/TAC270_Womens_Sexuality-2.mp3",
		"video": "",
		"url": "https://theallendercenter.org/2020/02/womens-sexuality-2/"
	},
	{
		"post_id": "170379677734",

		"label": "What Women Wish Men Knew about Women’s Sexuality",

		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960712",
		"created_at": "2020-01-31T00:00:00.000Z",
		"text": "Dr. Dan Allender and Rachael Clinton Chen are joined by guests Cathy Loerzel, Executive VP of The Allender Center and Christy Bauman, author of Theology of the Womb, to have a vulnerable discussion about what women wish men knew about women’s sexuality.",
		"img": "https://cdn.theallendercenter.org/wp-content/uploads/2020/01/WomensSexuality.jpg",
		"content": "<div class=\"the-content\"><p>Dr. Dan Allender and Rachael Clinton Chen are joined by guests Cathy Loerzel, Executive VP of The Allender Center and Christy Bauman, author of <em><a href=\"https://www.amazon.com/Theology-Womb-Knowing-through-Woman/dp/1532662173\" target=\"_blank\" rel=\"noopener noreferrer\">Theology of the Womb</a></em>, to have a vulnerable discussion about what women wish men knew about women’s sexuality.</p><p>Christy, an expert on theology of the body and women’s bodies, explains that women are often not allowed to think about what they want men to know due to the loudness of what a man wants.</p><p><strong>Christy:</strong> There’s this sense of jealousy &#8230; we don’t share the importance of female pleasure. Women are in a bind when we think about what do we tell men … we don’t have the luxury of exploring our sexuality without becoming objects.</p><p>Rachael, Christy, and Cathy discuss the impact of the purity movement and the confusion of not allowing yourself room to explore what your body is telling you and is made for. Specifically, Cathy dives into the difficulty of “flipping a switch” after marriage and the impact of abuse and sexual harm on women’s sexuality.</p><p><strong>Rachael:</strong> “I would want men to know also as women it&#8217;s not just the sexual part of our bodies that hold stories so many parts of our bodies hold stories. What does it mean to be tended to, to be curious about each other, to want to understand the history of touch or lack of touch.</p><p><strong>Cathy:</strong> To tend to a woman’s heart can be really sweet and sometimes very simple. It doesn’t have to be something that shuts you down, it can be an invitation to truer, better intimacy, better sex, better places of relating if there’s a sense of being able to enter into a place that feels more complex to you.</p><p>To close the conversation, Rachael, Christy, and Cathy share personal stories as they relate to feeling obligated to have sex, the need to be tended to, and the power of care.</p><p><em>“In order for the Kingdom of God to unfold in the way it&#8217;s meant to unfold and for the work we’re meant to do in this world, we’ve got to bring our embodied selves to the table.”</em> Rachael Clinton Chen</p><h2>Resources</h2><ul><li><a href=\"https://theallendercenter.org/2019/11/men-women-sexuality/\" target=\"_blank\" rel=\"noopener noreferrer\"><em>What Men Wish Women Knew about Men’s Sexuality</em></a></li><li><a href=\"https://theallendercenter.org/2019/10/men-sexuality/\" target=\"_blank\" rel=\"noopener noreferrer\"><em>What Men Wish Men Knew about Men’s Sexuality</em></a></li></ul></div>",
		"audio": "http://traffic.libsyn.com/theallendercenter/TAC267_Womens_Sexuality-1.mp3",
		"video": "",
		"url": "https://theallendercenter.org/2020/01/womens-sexuality-1/"
	},
	{
		"post_id": "170379677735",

		"label": "New Year, New You and Other Lies We Believe",

		"post_category_id": "1703796960640",
		"post_topic_id": "1703796960714",
		"created_at": "2020-01-21T00:00:00.000Z",
		"text": "A few years ago on New Year’s Eve I sat around a room with friends and we began to talk about our hopes for the new year. As we talked, I began to ponder the idea of change. Can we really change after a certain point or are we stuck in time, having lost our capacity to bend and mold as we could when we were younger? Most of us sitting around my fireplace that night had young kids sleeping in various places around the house, and we, as their parents, were exhausted, drinking one too many glasses of champagne that would come back to bite us the next morning as our children would inevitably wake at an ungodly hour welcoming in the New Year.",
		"img": "https://cdn.theallendercenter.org/wp-content/uploads/2020/01/Cathy_Blog_2020.jpg",
		"content": "<div class=\"the-content\"><p>A few years ago on New Year’s Eve I sat around a room with friends and we began to talk about our hopes for the new year. As we talked, I began to ponder the idea of change. <em>Can we really change after a certain point or are we stuck in time, having lost our capacity to bend and mold as we could when we were younger?</em> Most of us sitting around my fireplace that night had young kids sleeping in various places around the house, and we, as their parents, were exhausted, drinking one too many glasses of champagne that would come back to bite us the next morning as our children would inevitably wake at an ungodly hour welcoming in the New Year.</p><p>Our exhaustion was coupled with a gnawing sense that this may be as good as it gets. Can we change? Can we <a href=\"http://theallendercenter.org/2019/05/defiance-healing-spiritual-abuse/\" target=\"_blank\" rel=\"noopener noreferrer\">become more healed</a>? Can we know more love, more of God, get back into shape, eat healthier, drink less, and become more alive? Or is this the point where we call a spade a spade and release ourselves to a life of maintenance where nothing is ever enough?</p><p>You could see each of us looking at the other, wondering how to reconcile our desire for more with our weary hearts, trying to stay awake until the stroke of midnight and celebrate another year lived. But in truth, our hearts felt deflated as we silently considered our longings for this one, beautiful life while knowing we may not have enough energy left to make a difference.</p><p>It brought into focus my theology of healing. In that moment, none of us had any energy left to make a new resolution, to commit to a new hobby, to try and find more time for our spouse, or to spend more time praying or reading scripture. Life had taken us to the edge of our margin and we all knew it. Even that night, the anticipation of an early wake up call from our bubbly, energetic, needy kids was enough for us to admit defeat before we could even muster the semblance of a fight. So how in that state of hopelessness, how do you grapple with a longing for more despite a heart that feels dead inside, a body that could sleep for weeks, and a bank account that dwindles with each passing crisis? We went to bed grateful for good friends who shared this struggle, but with little to no resolve or answers to our questions.</p><p><strong>Many of us are pondering what 2020 will bring and who we want to be this year.</strong> Around this time every year, I hear the phrase floating around that is meant to bring motivation and renewed commitment: ”New Year, New You.” That phrase seductively propels us toward the fantasy that things can be better if we just try harder, or become more resolute or more disciplined.</p><p>This time every year I feel desperate to find something that will move me past the depression that often follows the holiday season to help bolster me toward a new season of hope and life. <strong>In reality, “New Year, New You” is all a lie. We are still “us” as the new year rolls over and celebrate the start of something new.</strong> But the truth is, I am the same on January 1 as I was December 31 and I think the real invitation for the new year is one of allowing ourselves to acknowledge where we are— the good, the bad and the ugly— and then grieve the fact that we are tired, overwhelmed, devastatingly alone, and unsure how we are going to make it through this season.</p><p>I wonder what healing would come if we let our <a href=\"http://theallendercenter.org/2019/11/the-loudness-of-grief/\" target=\"_blank\" rel=\"noopener noreferrer\">heartache set in</a> instead of overriding it. My guess is our hearts would rest and reset knowing there will not be more demand for our performance or resolve, but a soft space to land as we reflect on the year we lived as best as we could. <em>I wonder if our commitment is to grace, kindness, and grief, maybe we would find the life we are hoping for, but without the cruel intentions that come from judgment and self-contempt that so often lace our resolutions for a different life.</em></p><p>We are seduced by “New Year, New You” and the promise of resolutions because they allow us to ignore our heartache. We can choose to power up, start over, and become better without having to let our bodies dip down into the <a href=\"https://theallendercenter.org/2014/12/moving-grief/\" target=\"_blank\" rel=\"noopener noreferrer\">chasm of grief</a>. I have found that when we override this chasm and jump to resolution, we ignore the part of our heart that needs tending to.</p><p>This does not mean that we can’t try and keep our homes cleaner, be more committed to health, get outside more, or take that trip to Paris, but I think we can move toward that life in a countercultural way that lets us truly and intentionally sink into just how difficult this life is to live and be grateful that for the most part, we are doing it really well.</p></div>",
		"audio": "",
		"video": "",
		"url": "https://theallendercenter.org/2020/01/new-year-new-you/"
	},
	{
		"post_id": "170379677736",

		"label": "Complexities in Leadership, Part Two",

		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960711",
		"created_at": "2019-11-15T00:00:00.000Z",
		"text": "Dan and Cathy continue their conversation about the realities and complexities of being a leader. In this episode, questions about the particularities of being a woman in leadership are posed and thoughtfully addressed.",
		"img": "https://cdn.theallendercenter.org/wp-content/uploads/2019/11/Women-Leadership-2.jpg",
		"content": "<div class=\"the-content\"><p><span style=\"font-weight: 400;\">Dan and Cathy <a href=\"http://theallendercenter.org/2019/11/complexities-leadership-1/\" target=\"_blank\" rel=\"noopener noreferrer\">continue their conversation</a> about the realities and complexities of being a leader. In this episode, questions about the particularities of being a woman in leadership are posed and thoughtfully addressed. </span></p><p>To open the conversation, Dan restates the qualities of a good (and oftentimes reluctant) leader and the harmful effects of ambitious leaders. He then asks Cathy to walk through the role of a “good queen” in an organization within the prophet, priest, king or queen matrix.</p><p><strong>Cathy:</strong> The queen category of those three is about creating order. Being able to hold the role of the priest, who tells the story and the role of the people, create ritual, the prophet calls us to what is meant to be. The queen holds both of those realms in order and goodness for the present. It’s about creating boundaries, saying the true yes and true no, making the hard decisions that will be unpopular but are right for the kingdom, and creating flourishing for all who are involved.</p><p>Dan and Cathy then discuss what it is like to be a “queen,” or leader in a prophetic organization that is full of priests.</p><p><strong>Cathy:</strong> I think the hardest thing is feeling like you are disappointing people all the time. I want people to see how we can be better, but always feel like your decisions are never quite good enough and it’s always a little too slow or too fast—leadership is complicated.</p><blockquote><p>“Are you also willing to bear the disappointment of people who are quite brilliant, have a lot of insight, and then be able to bear their face when you say we went a different direction?”</p></blockquote><p>The conversation then moves into the challenges Cathy faces as a woman in <a href=\"http://theallendercenter.org/2016/06/binds-of-leadership-1/\" target=\"_blank\" rel=\"noopener noreferrer\">leadership</a>. Much has changed since she took a leadership role in The Allender Center, and she’s had to go “above and beyond” to prove she deserves to be at the helm.</p><p><strong>Dan:</strong> How do you keep your heart from being defensive when you’re having to do so much more than you know I would have to do if I were in that role?</p><p><strong>Cathy:</strong> Even as I talk about it, it just feels so unfair, and that feels young—that feels like a part of me that’s not where I want to lead from. I think it’s been a lot of having to tend to that place that says my experience is true, and it will not win. There’s something more that God is calling me to and if I can actually trust that God has given me some sense of leadership calling and gifting that I’m meant to steward, then that makes it easier because it feels like I’m fighting against spirits and principalities versus people.</p><p>To close the conversation, Dan acknowledges Cathy’s resilience that is due, in part, to having kept her grief about being in a leadership position and what it brings. He asks her, despite the cost, what things she looks forward to in her role.</p><p><strong>Dan:</strong> Your ability to hold both great strength, ferocity, but equal tenderness and kindness, that’s what I look for in a leader. Will you call me to go die, but also grieve that I may end up losing my life.</p><p><strong>Cathy:</strong> There’s such an opportunity to figure out: What does it look like to lead with strength and passion and fervor but also maintain a sense of the feminine spirit of God? What does it mean for me to see part of my leadership calling as a capacity to hold life in me and birth it and to bring forth goodness and wholeness in a different sort of way than a masculine creating of it?</p></div>",
		"audio": "http://traffic.libsyn.com/theallendercenter/TAC259_Women_In_Leadership_Part_Two.mp3",
		"video": "",
		"url": "https://theallendercenter.org/2019/11/complexities-leadership-2/"
	},
	{
		"post_id": "170379677737",

		"label": "Complexities in Leadership, Part One",

		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960711",
		"created_at": "2019-11-07T00:00:00.000Z",
		"text": "In this episode of the podcast, Dan is joined by Cathy Loerzel, Executive Vice President of The Allender Center, to talk about the realities and complexities of being a leader. Dan believes that people who are good leaders are also reluctant leaders, a theme you will hear throughout their conversation.",
		"img": "https://cdn.theallendercenter.org/wp-content/uploads/2019/11/Women-Leadership2.jpg",
		"content": "<div class=\"the-content\"><p><span style=\"font-weight: 400;\">In this episode of the podcast, Dan is joined by Cathy Loerzel, Executive Vice President of The Allender Center, to talk about the realities and complexities of being a leader. Dan believes that people who are good leaders are also reluctant leaders, a theme you will hear throughout their conversation. </span></p><p><strong>Dan:</strong> I believe, at the depths of my being, that people who are good leaders are reluctant leaders. Who, in many ways, don’t have the ambition to lead but end up finding themselves nonetheless in a position in which they get cornered by God.</p><p><strong>Cathy:</strong> Even when you start talking about leadership, immediately there’s something in me that wants to run the other direction. As soon as you name yourself a leader or believe you have something to say on how to lead there are problems that immediately come to bear.</p><p>Cathy notes that <a href=\"http://theallendercenter.org/2016/06/binds-of-leadership-1/\" target=\"_blank\" rel=\"noopener noreferrer\">leadership</a> isn’t something one necessarily chooses, but something that is inside of you. She illustrates by describing how she took charge of a group photo that was not going well until she stepped in to help organize its participants.</p><p><strong>Cathy:</strong> There’s something in me that’s always standing back and seeing if there is going to be somebody else to step forward. And when I see no one stepping forward &#8230; it becomes impossible for me not to step in.</p><p>Dan asks Cathy how she came to be a leader, and Cathy responds by telling the story of her formative years, and how in multiple instances, even at the tender age of five, she learned to create order both at home and in the classroom.</p><p><strong>Cathy:</strong> There’s something to leading where you have to be a little bit fearless. Someone has to be at the helm saying “We’re going to go this way, and I think we’re going to find land.” If you don’t have that person then there’s going to be chaos.</p><p><strong>Dan:</strong> How do you bear the cost? You’ve known there will be a cost to [leadership] that is on most occasions greater than the so-called benefit. So how have you stayed the course?</p><p>In response, Cathy acknowledges the loneliness, isolation, and <a href=\"http://theallendercenter.org/2019/07/scapegoating-part-1/\">scapegoating</a> that occurs when someone becomes a leader. Being a leader does not mean your tasks will get easier, rather the opposite, so learning to develop resilience has been important in Cathy’s leadership journey. She also recognizes the importance of surrounding yourself with mentors and people who can be a steadying presence in your life.</p><p>To close, Dan says the process of leading is worth nothing if it does not call him to be a better person, to be more connected with his friends and colleagues, and to connect him to his relationship with Jesus.</p></div>",
		"audio": "http://traffic.libsyn.com/theallendercenter/TAC258_Complexities_In_Leadership_Part_One.mp3",
		"video": "",
		"url": "https://theallendercenter.org/2019/11/complexities-leadership-1/"
	},
	{
		"post_id": "170379677738",

		"label": "Trauma and Memory in The Tale, Part Two",

		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960713",
		"created_at": "2018-11-02T00:00:00.000Z",
		"text": "This week, Dan continues his conversation with Cathy Loerzel, Executive Vice President, about The Tale, Jennifer Fox’s powerful, devastating film that is available to stream on HBO or Amazon. Cathy and Dan discuss more of the dynamics that make this such an important work of art, and they reflect on categories for further discussion and exploration—like the surprising and disturbing presence of arousal even in the midst of abuse.",
		"img": "https://cdn.theallendercenter.org/wp-content/uploads/2018/10/The-Tale-Jennifer-Fox.png",
		"content": "<div class=\"the-content\"><p>This week, Dan continues his conversation with <a href=\"https://theseattleschool.edu/faculty-staff/directory/loerzel-cathy/\" target=\"_blank\" rel=\"noopener noreferrer\">Cathy Loerzel</a>, Executive Vice President, about <a href=\"https://thetalemovie.com/\" target=\"_blank\" rel=\"noopener noreferrer\"><em>The Tale</em></a>, Jennifer Fox’s powerful, devastating film that is available to stream on <a href=\"https://www.hbo.com/movies/the-tale\" target=\"_blank\" rel=\"noopener noreferrer\">HBO</a> or <a href=\"https://www.amazon.com/Tale-Laura-Dern/dp/B07D8LTCL1\" target=\"_blank\" rel=\"noopener noreferrer\">Amazon</a>. Cathy and Dan discuss more of the dynamics that make this such an important work of art, and they reflect on categories for further discussion and exploration—like the surprising and disturbing presence of arousal even in the midst of abuse.</p><p><strong>Cathy:</strong> “It sounds weird to say, but this film is arousing. And no one wants to be aroused by a story about sexual abuse, which is why no one wants to talk about it. [&#8230;] But the degree that you’re familiar with your own arousal is the degree to which you’ll be able to stay with someone else’s abuse stories and trauma stories.”</p><p>There is an alluring nature to the tenderness and affection directed toward Jennifer by her abusers in their work of grooming. Cathy and Dan discuss how, if we cannot acknowledge our body’s response to that allure—if we cannot name our desire for connection and intimacy—then surviving our stories of abuse will necessitate silencing our bodies and cursing our desire.</p><p><strong>Dan:</strong> “The depth of the complicity is only understood with regard to this refraction of horror that any abused person has to grapple with, and that is: my body betrayed me.”</p><blockquote><p>I don’t know if I’ve ever had any kind of work of art confirm and come alongside as such a friend of our own labor.</p></blockquote><p>Much of Dan’s theory and our framework at The Allender Center explores the connection between arousal and disgust—an unsettling sense of arousal is often on the flip side of abuse. As we walk with others through their stories of harm, we find that much of our work resides in those places where we are more comfortable with our disgust than with our arousal—that’s where the war of shame lies.</p><p><strong>Cathy:</strong> “It’s very shame inducing to start stepping into this, but I think you have to in order to bring any sort of honor and healing into these parts of our hearts.”</p><p><strong>Dan:</strong> “And no victim is ever meant to be the sole guardian of their own story, which is why the shame that comes with complicity, arousal, fear, judgement, contempt—it silences and isolates. No one is meant to be alone in this memory.”</p><p>We are deeply grateful to HBO for helping bring this film to the world, and we’re especially grateful to Jennifer Fox for her courage, insight, and artistry. May Jennifer’s bravery in telling her story light a path for many, many others to engage their own stories and wrestle with the realities of abuse in creative and innovative ways.</p><p><strong>Cathy:</strong> “She wouldn’t be able to create this film if she hadn’t done that work, if she hadn’t gone back and allowed her own heart and mind to tell the truth in a different sort of way. I commend her for the work she’s done and for how brave she is in bringing it to the public. Our hope in talking about this is that this would be another vehicle for us to continue to speak truth, and to find freedom. It’s not just about telling the truth. It’s because the truth will set you free.”</p><p><strong>Dan:</strong> “We need art. We need beauty. And this is a beautiful film. [&#8230;] We need art to tell the truth. Because the truth itself, in its own fragmentation, needs images, scenes, scenarios. It needs music, it needs poetry, it needs painting, it needs film. That’s part of the engagement with the truth.”</p><hr /><p><em>Image courtesy of <a href=\"https://thetalemovie.com/\" target=\"_blank\" rel=\"noopener noreferrer\">thetalemovie.com</a>.</em></p></div>",
		"audio": "http://traffic.libsyn.com/theallendercenter/TAC207_Trauma_and_Memory_in_The_Tale_Part_Two.mp3",
		"video": "",
		"url": "https://theallendercenter.org/2018/11/trauma-memory-the-tale-2/"
	},
	{
		"post_id": "170379677739",

		"label": "Trauma and Memory in The Tale, Part One",

		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960713",
		"created_at": "2018-10-26T00:00:00.000Z",
		"text": "This week, Dan is joined by Cathy Loerzel, Executive Vice President, for a conversation about The Tale—a beautiful, harrowing new film by Jennifer Fox about childhood sexual abuse. Cathy shares how she stumbled on the movie on HBO this summer and immediately started alerting our team about it; Dan recalls that it was less of a recommendation than a command: You need to watch this film.",
		"img": "https://cdn.theallendercenter.org/wp-content/uploads/2018/10/The-Tale-Jennifer-Fox-2.jpg",
		"content": "<div class=\"the-content\"><p>This week, Dan is joined by <a href=\"https://theseattleschool.edu/faculty-staff/directory/loerzel-cathy/\" target=\"_blank\" rel=\"noopener noreferrer\">Cathy Loerzel</a>, Executive Vice President, for a conversation about <a href=\"https://thetalemovie.com/\" target=\"_blank\" rel=\"noopener noreferrer\"><em>The Tale</em></a>—a beautiful, harrowing new film by Jennifer Fox about childhood sexual abuse. Cathy shares how she stumbled on the movie on HBO this summer and immediately started alerting our team about it; Dan recalls that it was less of a recommendation than a command: “You need to watch this film.”</p><p><strong>Cathy:</strong> “It was one of the most excruciating, troubling, confirming films that I have ever seen in terms of the work that we do here at The Allender Center.”</p><p><strong>Dan:</strong> “I had to take three Tums just to get through the sense of nausea and heartbreak. It is a stunning film. For anyone who has addressed, is addressing, is working with the issues of trauma and abuse, this is a must-see film.”</p><blockquote><p>So few people are talking about the reality of childhood sexual abuse.</p></blockquote><p>While <em>The Tale</em> is intense, devastating, and potentially triggering for abuse survivors, Cathy and Dan stress that it is not gratuitous. With great insight and creativity, it tells the story of what happens in childhood sexual abuse and wrestles with how that story continues to unfold in adulthood. Dan and Cathy discuss how many of the dynamics that emerge in the film—like the grooming, ambivalence, and family of origin realities that mark stories of abuse—bring to life much of the theory that we engage at The Allender Center.</p><p><strong>Cathy:</strong> “A lot of the work that we do is taking bits of memory and creating the movie around it, bringing a black and white description into color and putting a fabric around it, putting texture around it, putting smells and even the scenery around it in a different way that allows people to step into abuse memories in a different sort of way. That’s what Jennifer Fox is doing in this movie.”</p><p>The narrative structure of <em>The Tale</em>, crafted with such clear thoughtfulness and care, is a reflection of the fragmentation that marks stories of trauma. It wrestles with deep questions about memory, truth, intention, and so much more—without offering quick or easy answers. Instead, it pulls you into the fragmentation of memory and the horror of the truth.</p><p><strong>Dan:</strong> “In the process, you’re going to discover that her memory is present, but it’s past. It’s fragmented, it’s distorted, it’s accurate, inaccurate. And the past speaks to the future. The 13-year-old girl interacts with the adult woman, just as we already know that memory is never a kind of verbatim story or narrative. It’s fragmented. [&#8230;] It’s brilliant how she tells the story, and yet you have to enter her fragmentation to be able to follow the story, which can’t be followed.”</p><p>Cathy and Dan discuss other aspects of the film that reflect its brilliance: the seductive allure of the abusers, the awareness that abuse never occurs in a vacuum, the cunning nature of evil, and the way abuse fosters a war with our desire for connection. All of this is so crucial to engaging our stories with the hope of healing, and we are deeply grateful for—and awed by—Jennifer Fox for sharing this story. Join us next week as Dan and Cathy continue this conversation. And if you’re able to do so in a way that feels honoring to your own story, we do recommend watching <em>The Tale</em> (available on <a href=\"https://www.hbo.com/movies/the-tale\" target=\"_blank\" rel=\"noopener noreferrer\">HBO</a> or <a href=\"https://www.amazon.com/Tale-Laura-Dern/dp/B07D8LTCL1\" target=\"_blank\" rel=\"noopener noreferrer\">Amazon</a>) before our next episode.</p><p><strong>Dan:</strong> “You will find it a resource for honor and grief. It will help you honor and engage the story of others with far more sensitivity. And if it’s part of your own story, even though there are things that will be radically different, I believe that it will give you new grief. I felt new grief, and yet new honor about the great privilege that we have to be part of a community that addresses trauma and abuse.”</p><hr /><p><em>Image courtesy of <a href=\"https://thetalemovie.com/\" target=\"_blank\" rel=\"noopener noreferrer\">thetalemovie.com</a>.</em></p></div>",
		"audio": "http://traffic.libsyn.com/theallendercenter/TAC206_Trauma_and_Memory_in_The_Tale_Part_One.mp3",
		"video": "",
		"url": "https://theallendercenter.org/2018/10/trauma-memory-the-tale-1/"
	},
	{
		"post_id": "170379677740",

		"label": "Story Sage, Part Three",

		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960713",
		"created_at": "2018-02-23T00:00:00.000Z",
		"text": "Dan Allender, Cathy Loerzel, and Rachael Clinton conclude their conversation about our upcoming online course, Story Sage, by exploring what might be the most volatile and dangerous terrain in this work: family of origin.",
		"img": "https://cdn.theallendercenter.org/wp-content/uploads/2018/02/story-sage-part-3.jpg",
		"content": "<div class=\"the-content\"><p><span style=\"font-weight: 400;\">This week on the podcast, Dan concludes his conversation with </span><a href=\"https://theallendercenter.org/about/team/cathy-loerzel/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">Cathy Loerzel</span></a><span style=\"font-weight: 400;\">, Executive Director, and </span><a href=\"https://theallendercenter.org/about/team/rachael-clinton/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">Rachael Clinton</span></a><span style=\"font-weight: 400;\">, Assistant Director of Program Development and Admissions, about the art of meaningful conversations and the process of developing </span><a href=\"https://theallendercenter.org/offerings/online-courses/story-sage-series/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">our new online course, Story Sage</span></a><span style=\"font-weight: 400;\">. </span></p><p><b>Cathy:</b><span style=\"font-weight: 400;\"> “Your freedom is dependent on your capacity to name truth.”</span><span style=\"font-weight: 400;\"><br /></span><span style=\"font-weight: 400;\"><br /></span><span style=\"font-weight: 400;\">Story Sage will offer a second course in which Dan engages the particular story of one brave woman live on camera, interspersed with segments of him, Cathy, and Rachael discussing his process and reflecting on how he was seeing themes and developing a narrative as he was engaging this story. That engagement opens the door to discuss what is perhaps the most volatile and precipitous terrain in this work: family of origin.</span></p><p><b>Rachael:</b><span style=\"font-weight: 400;\"> “When we use words like attunement, containment, repair, we’re talking about attachment. And we know that our family of origin is where our primary attachment structures get developed. Therefore they have deep implications for how we relate to the world around us and make sense of our abuse.”</span></p><p><b>Cathy:</b><span style=\"font-weight: 400;\"> “Abuse never happens in a vacuum.”</span></p><p><b>Dan:</b><span style=\"font-weight: 400;\"> “There is harm that every child is going to experience, no matter how perfect the family.”</span></p><p><span style=\"font-weight: 400;\">Rachael, Cathy, and Dan discuss how considering the environment and dynamics in our families of origin is essential to engaging our stories of trauma and abuse, even if the harm occurred outside of the home. But even beginning to wonder about that, for many people, feels like betrayal—meaning we will encounter suspicion, defenses, and deep fear.</span></p><p><b>Dan:</b><span style=\"font-weight: 400;\"> “Part of what it means to be a story sage is to know how to walk through minefields without blowing yourself up or the person that you’re walking with. It’s not easy.”</span></p><p><span style=\"font-weight: 400;\">As the conversation unfolds, they share their hope that Story Sage will be an opportunity for you to grow your own unique gifts and calling. This is not about learning to do what Dan does, but about gaining tools and theories to build your own capacity to engage stories with freedom, fluidity, and power—and in a way that only you can.</span></p><p><b>Rachael:</b><span style=\"font-weight: 400;\"> “That’s one of the things this course offers: a lot more categories, and a framework to even be able to build an imagination around how you could possibly move into someone’s story with a little more wisdom.”</span></p></div>",
		"audio": "http://traffic.libsyn.com/theallendercenter/TAC171_Story_Sage_Part_Three.mp3",
		"video": "",
		"url": "https://theallendercenter.org/2018/02/story-sage-3/"
	},
	{
		"post_id": "170379677741",

		"label": "Story Sage, Part Two",

		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960713",
		"created_at": "2018-02-16T00:00:00.000Z",
		"text": "This week, as we gear up for our new Story Sage online course, Dan Allender, Cathy Loerzel, and Rachael Clinton continue their conversation about what it means to enter the stories of others with curiosity, attunement, and care.",
		"img": "https://cdn.theallendercenter.org/wp-content/uploads/2018/02/story-sage-part-2-1200x675.jpg",
		"content": "<div class=\"the-content\"><p><span style=\"font-weight: 400;\">This week on the podcast, Dan continues his conversation with </span><a href=\"https://theallendercenter.org/about/team/cathy-loerzel/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">Cathy Loerzel</span></a><span style=\"font-weight: 400;\">, Executive Director, and </span><a href=\"https://theallendercenter.org/about/team/rachael-clinton/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">Rachael Clinton</span></a><span style=\"font-weight: 400;\">, Assistant Director of Program Development and Admissions, continue their conversation about what it means to enter the stories of others with curiosity, attunement, and care. As we gear up for our new Story Sage online course, we’re inviting you to consider how you might develop the capacity to enter stories of harm and heartache for the sake of healing. <a href=\"https://theallendercenter.org/story-sage-interest/\" target=\"_blank\" rel=\"noopener noreferrer\">Click here</a> to be the first to know when we launch this new online course.</span></p><p><b>Dan:</b><span style=\"font-weight: 400;\"> “We really want people to grow in a greater sense of what is involved, what it costs, and what it gains to be involved in meaningful conversations that go beyond the surface, beyond just empathy and advice.”</span></p><p><b>Rachael:</b><span style=\"font-weight: 400;\"> “Attunement offers delight. It’s a way of saying ‘I see you, I actually care deeply about you, and I want to be with you, even if where you’re at is not good.’”</span></p><p><span style=\"font-weight: 400;\">Cathy shares about a particular encounter with a woman at church who moved past social niceties to engage in something deeper and more lasting. That experience serves as a frame for the conversation as Rachael, Dan, and Cathy reflect on the importance of reading faces well, responding to what we see, and engaging in a way that expands awareness and helps make meaning.</span></p><p><b>Rachael:</b><span style=\"font-weight: 400;\"> “When I can be with someone who sits in the questions I have with me, that feels so much more honoring—even if I have to deal with the terror of ‘You just really saw something of my heart.’ Now I feel exposed, but I also feel not so alone in this.”</span></p><p><span style=\"font-weight: 400;\">They also return to the theme of containment from </span><a href=\"https://theallendercenter.org/2018/02/story-sage-1/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">last week’s episode</span></a><span style=\"font-weight: 400;\">, reflecting on the importance not rushing or presuming that others want us engaging their stories. A posture of invitation, permission, and setting parameters allows room to breathe and settle in, offering the containment that is crucial when engaging stories of trauma and harm. And when that happens, when our stories are engaged with honor and delight, it is nothing left than a taste of the goodness of God.</span><span style=\"font-weight: 400;\"><br /></span></p><p><b>Dan:</b><span style=\"font-weight: 400;\"> “Conversations are meant to create a ground where we come to know one another, you come to know yourself, I come to know myself, but ultimately we come to know God better in our relationship.”</span></p><p><span style=\"font-weight: 400;\">Next week, in the conclusion of this series, Dan, Rachael, and Cathy will continue unpacking these themes and will share more about the Story Sage online course, including the unique opportunity of stepping beyond themes and ideas into the particularities of one brave woman’s story.</span></p></div>",
		"audio": "http://traffic.libsyn.com/theallendercenter/TAC170_Story_Sage_Part_Two.mp3",
		"video": "",
		"url": "https://theallendercenter.org/2018/02/story-sage-2/"
	},
	{
		"post_id": "170379677742",

		"label": "Story Sage, Part One",

		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960713",
		"created_at": "2018-02-09T00:00:00.000Z",
		"text": "This week on the podcast, Dan is joined by Cathy Loerzel, Executive Director, and Rachael Clinton, Assistant Director of Program Development and Admissions, to explore the art of having deep, meaningful conversations about stories. This discussion comes as we prepare to launch a brand new online course, Story Sage, all about developing the capacity and skill to enter stories of harm with curiosity and care. Click here to be the first to know when we launch this new online course.",
		"img": "https://cdn.theallendercenter.org/wp-content/uploads/2018/02/story-sage-podcast-part-1.jpg",
		"content": "<div class=\"the-content\"><p><span style=\"font-weight: 400;\">This week on the podcast, Dan is joined by </span><a href=\"https://theallendercenter.org/about/team/cathy-loerzel/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">Cathy Loerzel</span></a><span style=\"font-weight: 400;\">, Executive Director, and </span><a href=\"https://theallendercenter.org/about/team/rachael-clinton/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">Rachael Clinton</span></a><span style=\"font-weight: 400;\">, Assistant Director of Program Development and Admissions, to explore the art of having deep, meaningful conversations about stories. This discussion comes as we prepare to launch a brand new online course, Story Sage, all about developing the capacity and skill to enter stories of harm with curiosity and care. <a href=\"https://theallendercenter.org/story-sage-interest/\">Click here</a> to be the first to know when we launch this new online course.</span></p><p><span style=\"font-weight: 400;\">In addressing the wider context of this conversation, Dan reflects on how, even as we’re able to see and hear more content than ever before, many of us have lost what it means to truly witness and deeply listen to stories. We are more connected than ever, with thousands of “friends” online, and yet the collective sense of isolation and disconnection is deep and pervasive. Awareness of widespread loneliness—and its devastating impacts—is growing, say Dan, and “people are dying to have their stories heard and engaged.”</span></p><blockquote><p><span style=\"font-weight: 400;\">People are dying to have their stories heard and engaged.</span></p></blockquote><p><span style=\"font-weight: 400;\">For years, The Allender Center has been addressing this deep need and desperate longing for connection. Story Sage will mark a significant step in that work as we continue to make our teaching and resources accessible for as many people as possible. The course will be divided into two separate classes: one about tools and frameworks for engaging stories well, and one that illustrates those concepts as Dan interacts with a woman who’s engaging her own story of sexual abuse.</span></p><p><b>Cathy:</b><span style=\"font-weight: 400;\"> “What we tried to do in this series is pull back the curtain a little.”</span></p><p><span style=\"font-weight: 400;\">Cathy reflects on her experience training facilitators and seeing over and over again how difficult it is to remain curious about and attuned to others—even for people who care deeply about this work and want to do it well. We bump up against the resistance and defenses that are rooted in our own story, not to mention the endless distractions and competing priorities of day-to-day life. To remain present with and curious about another person as you step into their stories of heartache and harm—that is an art, and it is far more costly than just being a “good listener.”</span></p><p><b>Cathy:</b><span style=\"font-weight: 400;\"> “So often our work is to move past empathy and advice.”</span></p><p><b>Rachael:</b><span style=\"font-weight: 400;\"> “To move to that deeper level takes both skill and a kind of wisdom—and courage.”</span></p><p><span style=\"font-weight: 400;\">Rachael, Cathy, and Dan begin unpacking the themes of attunement, containment, and rupture and repair that are essential for meaningful conversations, and they reflect on the challenge of pursuing deep connection even in our own families and friendships. Next week, they will continue this discussion by sharing more about the Story Sage online course and by exploring more of the nuts and bolts of facilitating healing in the stories of others.</span></p><p><b>Cathy:</b><span style=\"font-weight: 400;\"> “Our profoundly lonely hearts are aching. Engaging in these sorts of conversations is both what our hearts are made for and what will bring life.”</span></p></div>",
		"audio": "http://traffic.libsyn.com/theallendercenter/TAC169_Story_Sage_Part_One.mp3",
		"video": "",
		"url": "https://theallendercenter.org/2018/02/story-sage-1/"
	},
	{
		"post_id": "170379677743",

		"label": "Processing by Active Participation: Healing the Wounded Heart, Part Two",

		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960712",
		"created_at": "2017-10-06T00:00:00.000Z",
		"text": "This week, Dan is joined again by Cathy Loerzel and Rachael Clinton to further discuss our Healing the Wounded Heart online course. They particularly review the benefit of a closed Facebook group created for tribe members. The ultimate goal in creating the tribe option was to ensure that participants would not have to move through the course alone and would benefit from processing with others along the way. This added option has truly brought increased engagement with the material, and we hope very much that you can join us for our upcoming semester tribe!",
		"img": "https://cdn.theallendercenter.org/wp-content/uploads/2017/10/tac-podcast-processing-active-participation.jpg",
		"content": "<div class=\"the-content\"><p><span style=\"font-weight: 400;\">This week, Dan is joined again by Cathy Loerzel and Rachael Clinton to further discuss our <a href=\"https://theallendercenter.org/offerings/online-courses/healing-the-wounded-heart/\">Healing the Wounded Heart online course</a>. They particularly review the benefit of a closed Facebook group created for tribe members. The ultimate goal in creating the tribe option was to ensure that participants would not have to move through the course alone and would benefit from processing with others along the way. This added option has truly brought increased engagement with the material, and we hope very much that you can join us for our upcoming semester tribe!</span></p><p><span style=\"font-weight: 400;\">Rachael: You can either register and move through the course at your own pace or you can join a collective to move through the course in community. I was skeptical about the Facebook community, but I was blown away by the way this community developed and engaged.</span></p><p><span style=\"font-weight: 400;\">Dan: The material can fit to where you are. You have people who have never addressed these topics working with people who have been doing this work for years.</span></p><p><span style=\"font-weight: 400;\">Cathy: I noticed that a lot of people who wouldn’t have had resources or a way to access this otherwise.</span></p><p><span style=\"font-weight: 400;\">Dan: We also have excerpts from face-to-face interactions. That group actually went through the content themselves and still had questions.</span></p><p><span style=\"font-weight: 400;\">Rachael: We’ll continue to offer live Q&amp;As as well. I felt incredibly grateful for the collective that was committed to each other. It was an unexpected gift.</span></p><p><span style=\"font-weight: 400;\">Dan: As I read the conversations happening, I was blown away by the level of courage.</span></p><p><span style=\"font-weight: 400;\">Cathy: We realized people were caring for each other far better than we could care for them. People were taking themselves off the sidelines.</span></p><p><span style=\"font-weight: 400;\">Dan: We want healing for every person who participates, but part of healing is knowing how to give what you already have. We’ve seen many people begin here, then see so many people in their own community who have nothing in regard to these matters, and begin to use the redemption of their own life to bless others.</span></p><p><em>We are kicking off another <a href=\"http://courses.theallendercenter.org/p/healing-the-wounded-heart-semester-fall2017\">cohort group</a> October 16. We are offering a $50 discount to podcast listeners (valid through October 10). When you register, simply use the code TRIBEPODCAST.</em></p></div>",
		"audio": "http://traffic.libsyn.com/theallendercenter/TAC151_Processing_by_Active_Participation-_Healing_the_Wounded_Heart_Part_2.mp3",
		"video": "",
		"url": "https://theallendercenter.org/2017/10/processing-active-participation-healing-wounded-heart-part-2/"
	},
	{
		"post_id": "170379677744",

		"label": "The Power of Community: Healing the Wounded Heart, Part One",

		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960712",
		"created_at": "2017-09-29T00:00:00.000Z",
		"text": "This week, Dan is joined again by Cathy Loerzel and Rachael Clinton to further discuss our Healing the Wounded Heart online course. They particularly review the benefit of a closed Facebook group created for tribe members. The ultimate goal in creating the tribe option was to ensure that participants would not have to move through the course alone and would benefit from processing with others along the way. This added option has truly brought increased engagement with the material, and we hope very much that you can join us for our upcoming semester tribe!",
		"img": "https://cdn.theallendercenter.org/wp-content/uploads/2017/09/communityhealing1.jpg",
		"content": "<div class=\"the-content\"><p>This week, Dan is joined by Cathy Loerzel and Rachael Clinton. The three discuss the importance of community in the healing process and reflect upon ways in which community has benefited past “semester tribe” participants in our Healing the Wounded Heart online course. They take time to review three specific groups of people who would benefit from this kind of collective experience and outline what participants gain as a result of hearing others’ stories and letting their own stories be known.</p><p><em>Dan begins with the central question of this episode: Why do we need a community to work through healing in regard to abuse?</em></p><p>Rachael: To know you’re not alone and to be with a group of people who are invested in the work provides fresh wind in your sails.</p><p>Cathy: If evil uses abuse, one of the main places it does it’s work is when people are in isolation. Community works against what evil is trying to do.</p><p>Dan: Hearing other stories allows me to see my own story more clearly.</p><p><em>Dan explains that The Allender Center has created an <a href=\"https://theallendercenter.org/offerings/online-courses/healing-the-wounded-heart/\">online course</a> and an opportunity to join a community with which you can move through the course.</em></p><p><em>He asks: Who should consider joining this collective?</em></p><p>Dan: First, it is the person who has been abused. There are so many people who don’t understand the full effect trauma has had on their lives.</p><p>Cathy: Another group are those who have already done a lot of work concerning the abuse they have experienced but want to re-engage their experience with others who have suffered.</p><p>Dan: I have a desire to see spouses, friends, and those in relationships with others who have experienced sexual abuse join us so that they can know how to better love.</p><p>Rachael: Another group are leaders who are working with others who have experienced abuse.</p><p><em>Dan asks: What are we hoping people will gain from the course and the tribe experience?</em></p><p>Dan: First, we want people to gain clarity around abuse and shame.</p><p>Cathy: The second thing we want you to receive is comfort as others are able to care for you. I was overwhelmed by how comforting the participants have been to one another, especially in the Facebook group.</p><blockquote><p>Comfort in the face of abuse is exactly what evil doesn’t want you to have because comfort changes the human heart in a way little else can. &#8211; Cathy Loerzel</p></blockquote><p>Rachael: The third hope is that you would be able to retell your story in a truthful way.</p><blockquote><p>When you understand the reasons behind your addictive processes, they start to lose their power. &#8211; Rachael Clinton</p></blockquote><p><em>Dan explains that when The Allender Center first offered Healing the Wounded Heart, many found it difficult to proceed beyond the first couple lessons. It was important to add a way to see others around you moving forward.</em></p><p>Cathy: So much of our western way of being is pushing us toward isolation and ignoring where we have had harm. It is powerful to have a collective group around you.</p><blockquote><p>We all need a witness to our suffering with a promise that somehow redemption will come. &#8211; Dan Allender</p></blockquote><p><em>We are kicking off another <a href=\"https://theallendercenter.org/offerings/online-courses/healing-the-wounded-heart/\">cohort group</a> October 16. We are offering a $50 discount to podcast listeners (valid through October 10). When you register, simply use the code TRIBEPODCAST.</em></p></div>",
		"audio": "http://traffic.libsyn.com/theallendercenter/TAC150_The_Power_of_Community-_Healing_the_Wounded_Heart_Part_One.mp3",
		"video": "",
		"url": "https://theallendercenter.org/2017/09/power-community-healing-wounded-heart-part-1/"
	},
	{
		"post_id": "170379677745",

		"label": "Training Wounded Healers, Part Three",

		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960711",
		"created_at": "2016-03-19T00:00:00.000Z",
		"text": "This week on The Allender Center Podcast, Dan continues the “Training Wounded Healers” series all about our signature Training Certificate, a year-long program that guides individuals through engagement with their own stories of harm and trauma for the sake of learning to offer healing and restoration in the stories of others. Here, Dan is joined by Cathy Loerzel, MA, co-founder and Executive Director of The Allender Center, and Rachael Clinton, MDiv, a pastor, certificate facilitator, and member of our Teaching Staff. Cathy and Rachael are also graduates of The Seattle School of Theology & Psychology.",
		"img": "https://cdn.theallendercenter.org/wp-content/uploads/2016/03/alender.jpg",
		"content": "<div class=\"the-content\"><p><span style=\"font-weight: 400;\">This week on The Allender Center Podcast, Dan continues the </span><a href=\"http://theallendercenter.org/category/podcast/wounded-healers/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">“Training Wounded Healers”</span></a><span style=\"font-weight: 400;\"> series all about our signature Training Certificate, a year-long program that guides individuals through engagement with their own stories of harm and trauma for the sake of learning to offer healing and restoration in the stories of others. Here, Dan is joined by </span><a href=\"http://theallendercenter.org/about/team/cathy-loerzel/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">Cathy Loerzel</span></a><span style=\"font-weight: 400;\">, MA, co-founder and Executive Director of The Allender Center, and </span><a href=\"http://theallendercenter.org/about/team/rachael-clinton/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">Rachael Clinton</span></a><span style=\"font-weight: 400;\">, MDiv, a pastor, certificate facilitator, and member of our Teaching Staff. Cathy and Rachael are also graduates of </span><a href=\"http://theseattleschool.edu/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">The Seattle School of Theology &amp; Psychology</span></a><span style=\"font-weight: 400;\">. </span></p><p><span style=\"font-weight: 400;\">Cathy shares the story that led her to pursue an </span><a href=\"http://theseattleschool.edu/programs/counseling-psychology/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">MA in Counseling Psychology</span></a><span style=\"font-weight: 400;\"> at The Seattle School. Cathy was eventually invited to oversee the planning and execution of The Seattle School’s conferences, a position that led to her vision for the The Allender Center. In her current work facilitating the </span><a href=\"http://theallendercenter.org/offerings/trainings/externship-program/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">Externship Program</span></a><span style=\"font-weight: 400;\">, Cathy continues to develop her capacity to train others in the work of fostering healing and transformation. </span></p><p><b>Cathy: </b>“If it’s important work, let me figure out how to make it accessible, so that we can train people, so that this is something that can be happening all over the country and all over the world.”</p><p><span style=\"font-weight: 400;\">Rachael was invited to join The Allender Center at the very beginning, and as a leader she offers a unique presence that is both pastoral and therapeutic. She shares how working as a research assistant on Dan’s </span><a href=\"http://theallendercenter.org/store/products/sabbath/\" target=\"_blank\" rel=\"noopener noreferrer\"><i><span style=\"font-weight: 400;\">Sabbath</span></i></a> <span style=\"font-weight: 400;\">book eventually led to the opportunity to teach and facilitate groups, particularly at the intersection of trauma and spiritual formation. </span></p><p><b>Rachael: </b>“I just fell in love with getting to do story work in a group setting with people. It was the best kind of pastoral care you could ever do. [&#8230;] I really, really love journeying with people in the midst of their stories where their theological imagination, biblical imagination, the way they understand themselves in relation to God, God in relation to them, has been disordered because of the harm they’ve experienced.”</p><p><b>Dan: </b>“It’s crucial and so simple to say you can deal with the depths of a person’s horizontal story, their relationships with others, but always, always, always our labor is ultimately about your heart with Jesus, your engagement with God. And unfortunately or fortunately, the framework of your trauma provides a very substantial lens for how you interpret life in relationship to how you see God.”</p><p><span style=\"font-weight: 400;\">Cathy talks about the ongoing work of creating a standardized training program that allows for the particularities of every individual and the artistry of story work, while also offering the theoretical education and technical training that allows space for nuance and creativity. The desire to offer all of that, and to distill Dan’s complex theories into a practical, hands-on training, gave birth to The Allender Center’s Training Certificate and the Externship Program.</span></p><p><b>Cathy: </b>“We’re able to do a catalytic event that allows people who are very specifically trained to read into difficult stories and reveal things that are not typically revealed in an average reading of story. [&#8230;] How many people can we train over the next 10 years? How many people can we equip who are doing this work on the ground as lay leaders, as pastors, as friends, as spouses? My dream is to continue to equip people to go into the trenches and bring some sort of healing and allow Jesus to be revealed in ways that don’t happen through average care.”</p><p><b>Rachael: </b>“Part of what we do is give people categories through which to interpret their story more truthfully, to give them more freedom. So when I’m working with people I want to create a sanctuary where there is safety, and goodness, and a place for healing, but also a call to arms, that they would be empowered to come to life, to take what they’re receiving and learning and be able to offer that others.”</p><p><b>Dan: </b>“The design and desire is to give it away, to train people to be able to go out, somewhat under our experienced supervision and input, but go out and start works that engage, in your local church and your community, life and resurrection in the face of trauma. [&#8230;] We’re not going to be embarrassed to say, in some sense, this is an invitation to come check us out and begin to ask, how are you called to engage the issues of trauma, and how can we join you in the work of God to help you become better at what you do?”</p><p><em><span style=\"font-weight: 400;\">We are currently accepting applications for our 2016-2017 </span><a href=\"http://theallendercenter.org/offerings/trainings/training-certificates/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">Training Certificate</span></a><span style=\"font-weight: 400;\"> and </span><a href=\"http://theallendercenter.org/offerings/trainings/externship-program/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">Externship Program</span></a><span style=\"font-weight: 400;\">, and we would love to hear from you about how you might partner with us in this journey. </span></em></p></div>",
		"audio": "http://traffic.libsyn.com/theallendercenter/TAC071-Training-Wounded-Healers-part-three.mp3",
		"video": "",
		"url": "https://theallendercenter.org/2016/03/training-wounded-healers-3/"
	},
	{
		"post_id": "170379677746",

		"label": "Training Wounded Healers, Part One",

		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960711",
		"created_at": "2016-03-05T00:00:00.000Z",
		"text": "This week on The Allender Center Podcast, Dan launches a new series exploring the heart and vision behind our unique Training Certificate, a year-long program that guides individuals through engagement with their own stories of harm and trauma for the sake of learning to offer healing and restoration in the stories of others.",
		"img": "https://cdn.theallendercenter.org/wp-content/uploads/2016/03/alender.jpg",
		"content": "<div class=\"the-content\"><p>This week on The Allender Center Podcast, Dan launches a new series exploring the heart and vision behind our unique <a href=\"http://theallendercenter.org/offerings/trainings/training-certificates/\" target=\"_blank\" rel=\"noopener noreferrer\">Training Certificate</a>, a year-long program that guides individuals through engagement with their own stories of harm and trauma for the sake of learning to offer healing and restoration in the stories of others.</p><p>“Trauma exposes something of our own efforts to create a false Eden. When we have our Eden blown up, what’s then discovered is that we’ve been on a long path of trying to find our way back.”</p><p>“Our task is inviting people into a framework to consider their own trauma and abuse story as it then opens new meaning and power to understand the story of Jesus’ death, resurrection, and ascension.”</p><p><span style=\"font-weight: 400;\">Our Training Certificate was formed out of the core assumption that trauma is far more widespread than many people would like to believe. A common perception is that trauma affects only an unfortunate few, but the reality is that all of us bear stories of betrayal and loss that introduce some level of trauma in our lives.</span></p><p>“Trauma is the unexpected and profound shattering of our sense of normalcy. It comes with any significant injury or violation, any kind of deep-hearted insult that erodes not only our sense of normalcy, but in some ways erodes our sense of future. Therefore it brings a significant disruption to our sense of self. [&#8230;] Those realities are not something that only the professional class of therapist or helper is intended to engage. Really the frontline of engagement with these matters has to do with the believing community being able to walk alongside of others into invite them into a process in which life is reconfigured, realigned, and in many ways, reformed.”</p><p><span style=\"font-weight: 400;\">Dan talks about how traumatic experiences disregulate our bodies, leaving us in a perpetual state of fight, flight, or freeze, as well as our memory and our ability to engage our own stories without being overwhelmed, disoriented, and retraumatized. </span></p><p>“We’ve got this mess going on, and what often happens is that my very heart, soul, mind, and being are cast into this disruptive ocean. Now the question is, who will I become?”</p><p><span style=\"font-weight: 400;\">In engaging trauma, the first task is to help find some sense of stability—the fundamental feeling that we will be able to survive. Then, as friends, families, and communities of faith, we are called to walk with individuals through the process of discovering new beauty, new goodness, and a fuller sense of self—out of the very places that have been so marked by pain and brokenness.</span></p><p>“Trauma gives us a context to engage the upheaval, not only to help mitigate it and to stabilize, but to actually walk with a person through the process of helping them reform, reconfigure, who they wish to be in the midst of a world that brings and allows this kind of harm.”</p><p><span style=\"font-weight: 400;\">The Allender Center’s Training Certificate includes four unique weekend sessions over the course of an 8-month journey. In the first week, participants reflect on and share the tragedy—no matter how small or insignificant it seems—in their own story, and they begin to engage the stories of others in the context of a small group led by one of our trained facilitators. The second week focuses on attachment, containment, and the failure of attunement in our families of origin. The third week invites participants to wrestle with their sexual history, identifying the people, events, processes, and beliefs that have formed them into the person they are today. In the fourth and final week, participants look at their own unique gifts, talents, and callings the unique directions they can take this work in their families, communities, churches, and careers.</span></p><p><span style=\"font-weight: 400;\">As we continue this series in future weeks, Dan will invite his wife, Becky Allender, to reflect on her experience in the Training Certificate, and then we will hear from Cathy Loerzel, co-founder of The Allender Center, about her heart behind creating opportunities for leaders and professionals to do in-depth work in their own stories and help foster healing in the stories of others.</span></p></div>",
		"audio": "http://traffic.libsyn.com/theallendercenter/TAC069-Training-Wounded-Healers-part-one.mp3",
		"video": "",
		"url": "https://theallendercenter.org/2016/03/wounded-healers-podcast-1/"
	},
	{
		"post_id": "170379677747",

		"label": "Goodbye Old Friend",

		"post_category_id": "1703796960640",
		"post_topic_id": "1703796960711",
		"created_at": "2015-09-10T00:00:00.000Z",
		"text": "In the chaos and urgency of tragedy, it is difficult to slow down and allow ourselves to grieve. As our adult self makes decisions and takes action, can we still let ourselves feel the sadness, fear, and loneliness of our inner child? That was the gut-wrenching challenge faced by Cathy Loerzel, Executive Director of The Allender Center after a personal tragedy struck in the summer of 2015.",
		"img": "https://cdn.theallendercenter.org/wp-content/uploads/2015/09/Gizmo.jpg",
		"content": "<div class=\"the-content\"><p>In the chaos and urgency of tragedy, it is difficult to slow down and allow ourselves to grieve. As our adult self makes decisions and takes action, can we still let ourselves feel the sadness, fear, and loneliness of our inner child? That was the gut-wrenching challenge faced by <a href=\"http://theseattleschool.edu/directory/loerzel-cathy/\" target=\"_blank\" rel=\"noopener noreferrer\">Cathy Loerzel</a>, Executive Director of The Allender Center after a personal tragedy struck in the summer of 2015.</p><hr /><p>Two days ago, my one-and-a-half year-old son was playing in our living room, and I heard the loud growl and jaw snap of my beloved dog Gizmo, quickly followed by the piercing screams of my baby. My body went cold as I leapt over the couch to reach my son, only to see his forehead bleeding and three other teeth marks lodged far too near to his sweet, precious blue eyes. I pulled Liam into my arms, and my husband quickly pulled Gizmo outside as I tended to our son.</p><p><span style=\"font-weight: 400;\">Liam sobbed uncontrollably, tears rolled down my face, and my husband started to assess the severity of our son’s wounds. As we realized the wounds were superficial and Liam would be okay, the reality of what had just transpired began to sink into my heart.</span></p><p><span style=\"font-weight: 400;\">You see, Liam loves our dog. Gizmo is fluffy and loyal and has been a constant source of delight and fascination for his young and sweet heart. He is an old, big, lumbering dog who is in a great deal of pain and has become increasingly sensitive as his body deteriorates. Gizmo is also the dog that I got from the pound when I completed graduate school. He has been my sweet companion, protector, and comforter for the last eight years of my life. I love him with all that I am. He has seen me through break-ups, best friends moving out, my first Christmas on my own, getting married, and having my first baby. If you ever needed to find me, you could just look for the big golden dog at my feet.</span></p><p><span style=\"font-weight: 400;\">The horror of seeing something I love so much harm my baby caused my heart to break in five different ways, and the reality of what this inevitably means makes we want to sob from the depths of my heart. For those of you who have never loved a pet, this may seem absurd to you. And of course, the safety of my baby will trump all other things, but the agony of the unavoidable loss of my dog is almost unbearable.  </span></p><p><span style=\"font-weight: 400;\">As I thought about the fact that I will have to say goodbye to this love of my life, I realized this grief has a different feel than other grief I’ve experienced. I think our hearts have different memories and different compartments that are connected to our stories of loss. This particular loss is connected to my little girl heart that loved her doggy. It is my little girl heart that is breaking and my little girl heart that is losing her companion and protector.  </span></p><p><span style=\"font-weight: 400;\">My little girl heart is fragile and scared, and this big fluffy dog gave her comfort when her woman heart just could not hold all the fear. When I was scared at night the first time I slept in my townhouse alone, I crawled onto the floor with Gizmo and buried my face in his soft fur and cried. His long body held me and offered me comfort and fur to wipe my tears. He was the one that woke me up every morning during difficult seasons, circling my bed to beckon for a walk. I did not have to take walks alone because he was with me, I did not have to sleep in a tent alone because he was by my side, keeping me warm and warding away danger. He calmed me when I was sad or anxious, and he laid with me when I broke my foot and was alone on the couch all day. He was by my side late at night when I could not sleep during my last trimester of pregnancy. And when Liam was born, Gizmo was with me at 2 a.m. feedings. He could sense our vulnerability and fiercely protected us from those who approached until he could tell if they were friends or foes.  </span></p><p><span style=\"font-weight: 400;\">He has been the protector of my little girl heart and has loved me with a knowing and loyal soul. And now…now, he is old and in pain and has harmed my sweet son. There is no way I can put words to this heartache. My momma heart is solemn and steadfast and will protect my baby, but my little girl heart is broken and weeping on the floor.   </span></p><p><span style=\"font-weight: 400;\">I don’t know how to bear this level of heartache, and I don’t know how to make the final decision to say goodbye. I know I have to—I will choose well with bravery and honor and say goodbye to my dog, but I will also allow my little girl heart to weep in utter despair at the loss of her beloved soul friend. Gizmo—my sweet pup—I will love you forever, and I’m so grateful for how you have loved me and so grateful for how much I got to love you. You are the best dog I will ever have. Please tell Jesus all about our grand adventures and save a spot for me in heaven.  </span></p><p><i><span style=\"font-weight: 400;\">Note: Gizmo died a beautiful and honorable death on June 12, 2015. He died in my arms and in our backyard, covered with sweet tears of love and gratitude.</span></i><span style=\"font-weight: 400;\">  </span></p></div>",
		"audio": "",
		"video": "",
		"url": "https://theallendercenter.org/2015/09/goodbye-old-friend/"
	},
	{
		"post_id": "170379677748",

		"label": "Able to Love, Willing to Grieve, Part Two",

		"post_category_id": "1703796960640",
		"post_topic_id": "1703796960711",
		"created_at": "2015-04-09T00:00:00.000Z",
		"text": "Last week, Cathy Loerzel, Executive Director of The Allender Center, wrote about the before and after of childbirth, reflecting on the emotional impact her newborn son has had on her heart. Here, Cathy shares about the nature of that impact—one that has made her more tender to both the pain of abuse and the beauty of goodness.",
		"img": "https://cdn.theallendercenter.org/wp-content/uploads/2015/04/Woods.jpg",
		"content": "<div class=\"the-content\"><p><a href=\"http://theallendercenter.org/2015/04/able-to-love/\" target=\"_blank\" rel=\"noopener noreferrer\">Last week</a>, Cathy Loerzel, Executive Director of The Allender Center, wrote about the before and after of childbirth, reflecting on the emotional impact her newborn son has had on her heart. Here, Cathy shares about the nature of that impact—one that has made her more tender to both the pain of abuse and the beauty of goodness.</p><hr /><p>When my son was born, it is as if the veil between this world and the dream of Eden became a very thin line. I could barely handle violence on TV, reading about abuse in the news, or seeing the ravages of war ripping our world apart. I had to do significant research before watching a movie to make sure it was something I could handle, because I was vulnerable to every story I encountered. In truth, I was heartbroken by the wounded world my beautiful baby boy would encounter, and the reality of what he will suffer took my breath away.</p><p>I was completely undone when I looked at my sweet, trusting, curious child, knowing in my bones he was meant to experience uninterrupted beauty, goodness, and care. Now, looking back, I am in awe of my new-found empathy and quickness to tears and am rattled by how vulnerable I feel. I believe this thinly laced veil allows me to understand the love my son deserves, and it gives me a glimpse into what my heart was designed for as well. This may sound a little dramatic, but I wonder if this is not the way it is supposed to be? Why aren’t we on our knees wailing for the brokenness of our world? Why don’t we get choked up when we catch a glimpse of the harm we have endured? Why aren’t we praying and begging God to help us bring healing and protection and restoration to our world?</p><p>My sweet, beautiful, and wondrous boy has absolutely broken me.  As I have encountered his sweet heart, I have been taken by beauty and love in a way that has opened my heart and ruined me for this harsh world. I believe fully that we can only love to the degree we are willing to grieve, and in opening myself to love, I am now more susceptible to grief in a way that is both beautiful and terrifying.</p><p>Before he was born, I remember talking to a dear friend and admitting that I was afraid I might not love my son. After he was born my friend came over and asked me how I felt about that fear now. I looked at her through thick tears and said that I’m not afraid of not loving him, I’m afraid I will never be able to love anything else, other than him, ever again. But it turns out, it is quite the opposite. As my heart grows in its capacity, my ability to love and to feel is magnified.</p><p>My heart is now sensitive and ready to weep, and while this is admittedly inconvenient at times, I am so so grateful that when I sit with another story, when I consider my own harm, when I am faced with how I have harmed others, all I need to do is picture my sweet boy and I am immediately in touch with what Eden promised and the intention of God. This realization softens my heart, opens my hands, and casts my vision to the little boy or girl in all of us that needs and, quite frankly, deserves care. So I am pummeled, I am changed, and as is true for all deep change, it came from the complete undoing of a dramatic “before and after.”</p><p>Now as the months roll by, the veil is a little thicker, but I continue to make space for this new “after” and the gift of a pummelled heart. I get to be tender in a harsh and beautiful world where I will raise my son and sit with him as he encounters the wonder of the earth, the love of friends, and the violence of abuse. My only hope is that I will protect my new heart and not ask it to be hardened once more. I hope to be a tender and fierce presence that is quick to weep, slow to judge, and eager to love. I pray I am always sensitive to the realities of brokenness and that this sensitivity would keep my heart open and curious just like my sweet, wondrous boy.</p><blockquote><p>I hope to be a tender and fierce presence that is quick to weep, slow to judge, and eager to love.&#8221;</p></blockquote><hr /><p>Cathy Loerzel is the VP of Advancement of The Seattle School of Theology and Psychology and the Executive Director of The Allender Center. Cathy received her MA in Counseling Psychology from The Seattle School in 2007 and has been working with the school since graduation. She created The Allender Center along side of Dr. Allender and continues to invest as a teacher, group facilitator, and curriculum designer at the center. She also helped build The Seattle School Forum and The Leadership in the New Parish Certificate. Cathy is married to a local therapist, has a beautiful one-year-old son, and sweet old dog named Gizmo.</p></div>",
		"audio": "",
		"video": "",
		"url": "https://theallendercenter.org/2015/04/able-to-love-2/"
	},
	{
		"post_id": "170379677749",

		"label": "Able to Love, Willing to Grieve, Part One",

		"post_category_id": "1703796960640",
		"post_topic_id": "1703796960711",
		"created_at": "2015-04-02T00:00:00.000Z",
		"text": "For the next two weeks, Cathy Loerzel, Executive Director of The Allender Center, will write about the before and after of childbirth—a difficult, life-changing process that has increased both her capacity for love and her tenderness to pain.",
		"img": "https://cdn.theallendercenter.org/wp-content/uploads/2015/04/Woods.jpg",
		"content": "<div class=\"the-content\"><p><a href=\"http://theallendercenter.org/2015/04/able-to-love/\" target=\"_blank\" rel=\"noopener noreferrer\">Last week</a>, Cathy Loerzel, Executive Director of The Allender Center, wrote about the before and after of childbirth, reflecting on the emotional impact her newborn son has had on her heart. Here, Cathy shares about the nature of that impact—one that has made her more tender to both the pain of abuse and the beauty of goodness.</p><hr /><p>When my son was born, it is as if the veil between this world and the dream of Eden became a very thin line. I could barely handle violence on TV, reading about abuse in the news, or seeing the ravages of war ripping our world apart. I had to do significant research before watching a movie to make sure it was something I could handle, because I was vulnerable to every story I encountered. In truth, I was heartbroken by the wounded world my beautiful baby boy would encounter, and the reality of what he will suffer took my breath away.</p><p>I was completely undone when I looked at my sweet, trusting, curious child, knowing in my bones he was meant to experience uninterrupted beauty, goodness, and care. Now, looking back, I am in awe of my new-found empathy and quickness to tears and am rattled by how vulnerable I feel. I believe this thinly laced veil allows me to understand the love my son deserves, and it gives me a glimpse into what my heart was designed for as well. This may sound a little dramatic, but I wonder if this is not the way it is supposed to be? Why aren’t we on our knees wailing for the brokenness of our world? Why don’t we get choked up when we catch a glimpse of the harm we have endured? Why aren’t we praying and begging God to help us bring healing and protection and restoration to our world?</p><p>My sweet, beautiful, and wondrous boy has absolutely broken me.  As I have encountered his sweet heart, I have been taken by beauty and love in a way that has opened my heart and ruined me for this harsh world. I believe fully that we can only love to the degree we are willing to grieve, and in opening myself to love, I am now more susceptible to grief in a way that is both beautiful and terrifying.</p><p>Before he was born, I remember talking to a dear friend and admitting that I was afraid I might not love my son. After he was born my friend came over and asked me how I felt about that fear now. I looked at her through thick tears and said that I’m not afraid of not loving him, I’m afraid I will never be able to love anything else, other than him, ever again. But it turns out, it is quite the opposite. As my heart grows in its capacity, my ability to love and to feel is magnified.</p><p>My heart is now sensitive and ready to weep, and while this is admittedly inconvenient at times, I am so so grateful that when I sit with another story, when I consider my own harm, when I am faced with how I have harmed others, all I need to do is picture my sweet boy and I am immediately in touch with what Eden promised and the intention of God. This realization softens my heart, opens my hands, and casts my vision to the little boy or girl in all of us that needs and, quite frankly, deserves care. So I am pummeled, I am changed, and as is true for all deep change, it came from the complete undoing of a dramatic “before and after.”</p><p>Now as the months roll by, the veil is a little thicker, but I continue to make space for this new “after” and the gift of a pummelled heart. I get to be tender in a harsh and beautiful world where I will raise my son and sit with him as he encounters the wonder of the earth, the love of friends, and the violence of abuse. My only hope is that I will protect my new heart and not ask it to be hardened once more. I hope to be a tender and fierce presence that is quick to weep, slow to judge, and eager to love. I pray I am always sensitive to the realities of brokenness and that this sensitivity would keep my heart open and curious just like my sweet, wondrous boy.</p><blockquote><p>I hope to be a tender and fierce presence that is quick to weep, slow to judge, and eager to love.&#8221;</p></blockquote><hr /><p>Cathy Loerzel is the VP of Advancement of The Seattle School of Theology and Psychology and the Executive Director of The Allender Center. Cathy received her MA in Counseling Psychology from The Seattle School in 2007 and has been working with the school since graduation. She created The Allender Center along side of Dr. Allender and continues to invest as a teacher, group facilitator, and curriculum designer at the center. She also helped build The Seattle School Forum and The Leadership in the New Parish Certificate. Cathy is married to a local therapist, has a beautiful one-year-old son, and sweet old dog named Gizmo.</p></div>",
		"audio": "",
		"video": "",
		"url": "https://theallendercenter.org/2015/04/able-to-love-2/"
	},
	{
		"post_id": "170379677750",

		"label": "Moving into Grief",

		"post_category_id": "1703796960640",
		"post_topic_id": "1703796960711",
		"created_at": "2014-12-30T00:00:00.000Z",
		"text": "I am in the middle of moving, over Christmas, with a one-year-old baby, and I don’t wanna. I mean, I do—it is an amazing gift to our family to be able to move from our cramped townhouse into a beautiful house with a huge yard for our very active son to play in. We are thrilled and I want to cry. There are many reasons for this. First, moving is just hard—regardless of your circumstances. It is laborious, tedious, expensive, and fraught with details that would drive anyone mad. Second, it means change—deep change. And for those of us who like comfort and routine, this change can be undoing to the core.",
		"img": "https://cdn.theallendercenter.org/wp-content/uploads/2014/12/steam.jpg",
		"content": "<div class=\"the-content\"><p>I am in the middle of moving, over Christmas, with a one-year-old baby, and I don’t wanna. I mean, I do—it is an amazing gift to our family to be able to move from our cramped townhouse into a beautiful house with a huge yard for our very active son to play in. We are thrilled and I want to cry. There are many reasons for this. First, moving is just hard—regardless of your circumstances. It is laborious, tedious, expensive, and fraught with details that would drive anyone mad. Second, it means change—deep change. And for those of us who like comfort and routine, this change can be undoing to the core.</p><p>For me it goes even further, I grew up a military kid and I moved every two to three years for the majority of my life. No place really felt like home and moving was just part of life. I was always imagining where we would go next, never attaching or settling into where we were living in the moment. This pattern continued through most of my adult life until 2007 when I bought my first home in Seattle. For the first time I painted, bought furniture and appliances, and made my permanent address a house of my own. I settled into my life, my neighborhood, my walking paths, my coffee shops, and allowed my feet to sink into the soil. I felt like I was home and it was lovely, safe, and comforting. My home has represented a shift from a nomadic wandering to a heart rooted in community and routine. I became attached—and it is no surprise that during this time I sunk into career and calling, rescued a dog, got married, and had a baby.</p><p>Being rooted allowed me to find the places of my heart that had been inaccessible while always looking to the next adventure to dull the disconnected fragments of my life.  In that state of disconnectedness, moving was easy because I was detached and never felt the pain of upheaval. As I have allowed my roots to grow deep in this house and neighborhood a sort of healing has taken place. And up till this moment, I have been so grateful. But now I am moving again to a house in which our family can grow and flourish and I am heartbroken having to feel the pain for the first time of being dislodged from my home.</p><p>Sometimes healing is a double-edged sword. Now I can’t escape the pain of change or the suffering of being uprooted. I can’t choose to just turn it off and buckle up my emotions in order to pack, paint and clean. I am now connected to these sweet roots and must grieve the loss of my beautiful little townhouse tucked behind a fast-food chain where I can hear sirens all day and all night. I must grieve the fact that I have to go to a different grocery store and get to know a new neighborhood. My daily walks will be on a different path and I will have to say goodbye to my local coffee shop baristas. I have spent so much of my life avoiding this suffering and avoiding saying goodbye, but to honor the goodness that this house has brought me, I must suffer the loss.</p><p>As I suffer the loss, new roots will be able to grow and my heart will be open to my new life.  It is a strange dichotomy to know I have to grieve and suffer loss in order to find new life. My instinct is to cover my eyes, ignore the heartache and focus on decorating my new space in my mind. But instead, I must welcome my sorrow and sit and stare at my empty walls with boxes stacked to the ceiling and smile with tears at the memories that are stirred.  I must stand in my doorway with my little boy in my arms, my husband by my side and my dog circling our feet, take a deep breath, let the tears come and say goodbye to my first home.</p><p style=\"text-align: center;\">__________________________________________________</p><p>Cathy Loerzel is the VP of Advancement of The Seattle School of Theology and Psychology and the Executive Director of The Allender Center. Cathy received her MA in Counseling Psychology from The Seattle School in 2007 and has been working with the school since graduation. She created The Allender Center along side of Dr. Allender and continues to invest as a teacher, group facilitator, and curriculum designer at the center. She also helped build The Seattle School Forum and The Leadership in the New Parish Certificate. Cathy is married to a local therapist, has a beautiful one-year-old son, and sweet old dog named Gizmo.</p><p>&nbsp;</p></div>",
		"audio": "",
		"video": "",
		"url": "https://theallendercenter.org/2014/12/moving-grief/"
	}
]