[
	{
		"post_id": "170379677710",
		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960710",
		"title": "Which of the Six Types Are You? With Dan Allender and Cathy Loerzel",
		"featured": "FALSE",
		"created_at": "2021-10-26",
		"text": "This is another episode we would pay you to listen to if we could. Do you approach your friendships, your work, or the pain in your life more as the orphan, the stranger, or the widow? Don’t know what that means? We didn’t either until we read “Redeeming Heartache” and then talked with the brilliant psychologist, Dr. Dan Allender, and to our new wise friend, author and therapist Cathy Loerzel. Dan and Cathy helped us understand each of these approaches to the world, and invited us to live redeemed as a priest, prophet, or king and queen. Together we explore: What if I don’t think I’ve ever had trauma? Do I still need to do heart work? Why do I need to look back at my past? My present is hard enough. Why do I act this way in challenging situations? Join us?",
		"img": "https://lauriekrieg.com/wp-content/uploads/2021/10/ep-185_web.jpg",
		"content": "<div id=\"podcast-content\"> <h2>This is another episode we would pay you to listen to if we could.</h2> <p>Do you approach your friendships, your work, or the pain in your life more as the orphan, the stranger, or the widow?</p> <p>Don’t know what that means? We didn’t either until we read “Redeeming Heartache” and then talked with the brilliant psychologist, Dr. Dan Allender, and to our new wise friend, author and therapist Cathy Loerzel.</p> <p>Dan and Cathy helped us understand each of these approaches to the world, and invited us to live redeemed as a priest, prophet, or king and queen.</p> <p>Together we explore:</p> <p>What if I don’t think I’ve ever had trauma? Do I still need to do heart work?</p> <p>Why do I need to look back at my past? My present is hard enough.</p> <p>Why do I act this way in challenging situations?</p> <p>Join us?</p> <h3>Highlights</h3> <p>“To be able to rest and receive delight and have gratitude, you need to be able to be open to what other people can offer you…. So if you’re never in that place of being able to receive that with an open, trusting heart, then you’re always…coiled up and ready for the place that you’re gonna be harmed next. So it keeps you from being able to receive surprise and delight and play because you’re always, always, always looking around the corner.” -Cathy Loerzel</p> <p>“The reality is we all bear some of the effects of the Fall, and that’s what we’re calling trauma.” -Dan Allender</p> <p>“You can’t heal the present without going back to the past.” –Cathy Loerzel</p> <h3>Do the Next Thing</h3> <p>Want more of these two? Go read their book, <a href=\"https://www.amazon.com/Redeeming-Heartache-Suffering-Reveals-Calling/dp/0310362016\"><i>Redeeming Heartache</i></a>!</p> <p>Check out the <a href=\"https://theallendercenter.org\">Allender Center</a>, which both Dan and Cathy are a part of founding and leading!</p> <p>Dan is a veteran on the podcast! Here’s our <a href=\"https://lauriekrieg.com/podcast/sexuality-and-shame-with-dan-allender/\">first episode</a> with him.</p> <p>Looking for a fresh way to read Scripture? The CSB translation is a sponsor of the HIMH podcast! Learn more about our new favorite Bible at <a href=\"http://csbible.com/\">csbible.com</a>.</p> <p>Want something deeper than just the podcast? Join our <a href=\"https://www.facebook.com/groups/434827357279517\">Facebook group</a> and discuss with us!</p> <p>Watch this conversation! (COMING SOON)</p></div>",
		"audio": "https://chtbl.com/track/289G57/http://feeds.soundcloud.com/stream/1146421963-laurie-krieg-episode-185-which-of-the-six-types-are-you-with-dan-allender-cathy-loerzel.mp3",
		"url": "https://lauriekrieg.com/podcast/which-of-the-six-types-are-you-with-dan-allender-cathy-loerzel/"
	},
	{
		"post_id": "170379677711",
		"post_category_id": "1703796960640",
		"post_topic_id": "1703796960711",
		"title": "Wisdom of the Collective Mother",
		"featured": "FALSE",
		"created_at": "2021-09-13",
		"text": "These past 18 months have been hard. Hard on a personal level, hard on a professional level, and hard on a collective level. The pandemic has disconnected so many of us from the embodied wisdom of community, friendships, and relationships. We have needed to be physically removed for safety, but also we have been separated based on ideologies and deep skisms that have life and death seemingly attached to them. We are divided and skeptical and don’t know where to turn. The toll has been brutal and severe. Even more than we know at this point. We need care, wisdom, and direction as we navigate a complex, heartbreaking, and ever-changing world. We need wise elders and people who have come before us who can steady the ship and set a new course.",
		"img": "https://i0.wp.com/redtentliving.com/wp-content/uploads/2021/09/elmer-canas-hTrc3aG3OGY-unsplash-e1629743443998.jpg?fit=1100%2C733&ssl=1",
		"content": "<div class=\"entry-content container container-small clear\"> <p>These past 18 months have been hard. Hard on a personal level, hard on a professional level, and hard on a collective level. The pandemic has disconnected so many of us from the embodied wisdom of community, friendships, and relationships. We have needed to be physically removed for safety, but also we have been separated based on ideologies and deep skisms that have life and death seemingly attached to them. We are divided and skeptical and don&#8217;t know where to turn. The toll has been brutal and severe. Even more than we know at this point. We need care, wisdom, and direction as we navigate a complex, heartbreaking, and ever-changing world. We need wise elders and people who have come before us who can steady the ship and set a new course. <span id=\"more-15768\"></span></p> <p>For me, I found myself longing for a grandmother. A wise guide who would invite me into her home, make me tea, and teach me the art of making bread or a delicious berry pie. I longed for her to listen to my plight, my confusion, and my heartache and tell me how it was all going to be ok. I wanted her to remind me of who I am and who I could become. I longed for her to see my face, realize I was exhausted, take me to her spare bedroom, and invite me to rest while the bread baked. And while my fantasy was rich and lovely, I knew in my heart that no one was coming. There was no magical grandmother that could help me navigate this season of my life and I was alone. I was alone to read the books, glean the wisdom I needed, and try to decipher the code coming through my many screens and texts.</p> <p>But it was not working. I was desperate, and words on my own were not enough. Then this past winter, as much of my world was falling apart, I began the bold move of gathering with some women from my church. I had been isolated, in a deep season of turmoil and trauma, and needed a community of women who were committed to seeing the fullness of the world and would also place pillows under my body as I hit the bottom. We were each heartbroken in some way and left to navigate the season without a wise mother to guide us through. We were often wandering rudderless to make our own way. But as we met and talked, we realized that between all of our experiences of sorrow, grief, and heartache, there was one wise woman. <i>We </i>were the wise guide we needed.</p> <p>Collectively, we could hold each other and allow our pieces of wisdom to collide and become whole on behalf of each of us individually. There was enough to go around, and as our friendships progressed, we were able to hold dreams, hopes, calling, grief, fear, and combat curses against our body and souls.</p> <blockquote><p><em><strong>Together, we found the wise woman, and because it was not up to one of us individually, we were able to carry each other&#8217;s burden with ease and compassion. </strong></em></p></blockquote> <p>We were willing to help hold the complexity of who we were without either idealizing our circumstances or dismissing our pain. We were truth tellers and soul tenders, and in the end, I found myself literally being held up by their arms, floating in a pool, and grieving years of painful failure and loss.</p> <p>Together, they were strong enough to hold me, tender enough to wipe my tears, and loving enough to tell me I was good and also enough. It was the embodied wisdom and care I so deeply longed for, and it was utterly life changing. We were the wise woman, and instead of waiting for the non-existent rescuer to appear, we rose up and became what we all needed.</p> <p>Many of us are left desiring a singular person we can fully trust and drop into their wise arms and weep, but what if that which we desire is already here? What if it is not one person but all of us, together, that we really need? If that’s true, then we can be human sized, imperfect, broken, needy, and wise all at the same time. We don’t need to be heroic or all knowing, but we do need to be brave enough to risk presence and be available with whatever we can offer. If we can trust that those parts are enough, we can find a deep well of wisdom residing in the power of the women in our midst. We are the mothers we need; we are the wisdom that is born of suffering and loss. Together, we are enough.</p></div>",
		"url": "https://redtentliving.com/2021/09/13/wisdom-of-the-collective-mother/"
	},
	{
		"post_id": "170379677712",
		"post_category_id": "1703796960642",
		"post_topic_id": "1703796960713",
		"title": "What Is Story Work?",
		"featured": "TRUE",
		"created_at": "2020-10-30",
		"text": "Cathy answers the question: What is story work?",
		"img": "https://storage.cloud.google.com/cathy-loerzel/Images/cathy-square.jpg",
		"video": "https://vimeo.com/607537276/d1dde7904c",
		"url": "https://vimeo.com/607537276/d1dde7904c"
	},
	{
		"post_id": "170379677713",
		"post_category_id": "1703796960641",
		"post_topic_id": "1703796960712",
		"title": "The Power of Community: Healing the Wounded Heart, Part One",
		"featured": "FALSE",
		"created_at": "2017-09-29",
		"text": "This week, Dan is joined again by Cathy Loerzel and Rachael Clinton to further discuss our Healing the Wounded Heart online course. They particularly review the benefit of a closed Facebook group created for tribe members. The ultimate goal in creating the tribe option was to ensure that participants would not have to move through the course alone and would benefit from processing with others along the way. This added option has truly brought increased engagement with the material, and we hope very much that you can join us for our upcoming semester tribe!",
		"img": "https://cdn.theallendercenter.org/wp-content/uploads/2017/09/communityhealing1.jpg",
		"content": "<div class=\"the-content\"><p>This week, Dan is joined by Cathy Loerzel and Rachael Clinton. The three discuss the importance of community in the healing process and reflect upon ways in which community has benefited past “semester tribe” participants in our Healing the Wounded Heart online course. They take time to review three specific groups of people who would benefit from this kind of collective experience and outline what participants gain as a result of hearing others’ stories and letting their own stories be known.</p><p><em>Dan begins with the central question of this episode: Why do we need a community to work through healing in regard to abuse?</em></p><p>Rachael: To know you’re not alone and to be with a group of people who are invested in the work provides fresh wind in your sails.</p><p>Cathy: If evil uses abuse, one of the main places it does it’s work is when people are in isolation. Community works against what evil is trying to do.</p><p>Dan: Hearing other stories allows me to see my own story more clearly.</p><p><em>Dan explains that The Allender Center has created an <a href=\"https://theallendercenter.org/offerings/online-courses/healing-the-wounded-heart/\">online course</a> and an opportunity to join a community with which you can move through the course.</em></p><p><em>He asks: Who should consider joining this collective?</em></p><p>Dan: First, it is the person who has been abused. There are so many people who don’t understand the full effect trauma has had on their lives.</p><p>Cathy: Another group are those who have already done a lot of work concerning the abuse they have experienced but want to re-engage their experience with others who have suffered.</p><p>Dan: I have a desire to see spouses, friends, and those in relationships with others who have experienced sexual abuse join us so that they can know how to better love.</p><p>Rachael: Another group are leaders who are working with others who have experienced abuse.</p><p><em>Dan asks: What are we hoping people will gain from the course and the tribe experience?</em></p><p>Dan: First, we want people to gain clarity around abuse and shame.</p><p>Cathy: The second thing we want you to receive is comfort as others are able to care for you. I was overwhelmed by how comforting the participants have been to one another, especially in the Facebook group.</p><blockquote><p>Comfort in the face of abuse is exactly what evil doesn’t want you to have because comfort changes the human heart in a way little else can. &#8211; Cathy Loerzel</p></blockquote><p>Rachael: The third hope is that you would be able to retell your story in a truthful way.</p><blockquote><p>When you understand the reasons behind your addictive processes, they start to lose their power. &#8211; Rachael Clinton</p></blockquote><p><em>Dan explains that when The Allender Center first offered Healing the Wounded Heart, many found it difficult to proceed beyond the first couple lessons. It was important to add a way to see others around you moving forward.</em></p><p>Cathy: So much of our western way of being is pushing us toward isolation and ignoring where we have had harm. It is powerful to have a collective group around you.</p><blockquote><p>We all need a witness to our suffering with a promise that somehow redemption will come. &#8211; Dan Allender</p></blockquote><p><em>We are kicking off another <a href=\"https://theallendercenter.org/offerings/online-courses/healing-the-wounded-heart/\">cohort group</a> October 16. We are offering a $50 discount to podcast listeners (valid through October 10). When you register, simply use the code TRIBEPODCAST.</em></p></div>",
		"audio": "http://traffic.libsyn.com/theallendercenter/TAC150_The_Power_of_Community-_Healing_the_Wounded_Heart_Part_One.mp3",
		"url": "https://theallendercenter.org/2017/09/power-community-healing-wounded-heart-part-1/"
	},
	{
		"post_id": "170379677714",
		"post_category_id": "1703796960640",
		"post_topic_id": "1703796960711",
		"title": "Moving into Grief",
		"featured": "FALSE",
		"created_at": "2014-12-30",
		"text": "I am in the middle of moving, over Christmas, with a one-year-old baby, and I don’t wanna. I mean, I do—it is an amazing gift to our family to be able to move from our cramped townhouse into a beautiful house with a huge yard for our very active son to play in. We are thrilled and I want to cry. There are many reasons for this. First, moving is just hard—regardless of your circumstances. It is laborious, tedious, expensive, and fraught with details that would drive anyone mad. Second, it means change—deep change. And for those of us who like comfort and routine, this change can be undoing to the core.",
		"img": "https://cdn.theallendercenter.org/wp-content/uploads/2014/12/steam.jpg",
		"content": "<div class=\"the-content\"><p>I am in the middle of moving, over Christmas, with a one-year-old baby, and I don’t wanna. I mean, I do—it is an amazing gift to our family to be able to move from our cramped townhouse into a beautiful house with a huge yard for our very active son to play in. We are thrilled and I want to cry. There are many reasons for this. First, moving is just hard—regardless of your circumstances. It is laborious, tedious, expensive, and fraught with details that would drive anyone mad. Second, it means change—deep change. And for those of us who like comfort and routine, this change can be undoing to the core.</p><p>For me it goes even further, I grew up a military kid and I moved every two to three years for the majority of my life. No place really felt like home and moving was just part of life. I was always imagining where we would go next, never attaching or settling into where we were living in the moment. This pattern continued through most of my adult life until 2007 when I bought my first home in Seattle. For the first time I painted, bought furniture and appliances, and made my permanent address a house of my own. I settled into my life, my neighborhood, my walking paths, my coffee shops, and allowed my feet to sink into the soil. I felt like I was home and it was lovely, safe, and comforting. My home has represented a shift from a nomadic wandering to a heart rooted in community and routine. I became attached—and it is no surprise that during this time I sunk into career and calling, rescued a dog, got married, and had a baby.</p><p>Being rooted allowed me to find the places of my heart that had been inaccessible while always looking to the next adventure to dull the disconnected fragments of my life.  In that state of disconnectedness, moving was easy because I was detached and never felt the pain of upheaval. As I have allowed my roots to grow deep in this house and neighborhood a sort of healing has taken place. And up till this moment, I have been so grateful. But now I am moving again to a house in which our family can grow and flourish and I am heartbroken having to feel the pain for the first time of being dislodged from my home.</p><p>Sometimes healing is a double-edged sword. Now I can’t escape the pain of change or the suffering of being uprooted. I can’t choose to just turn it off and buckle up my emotions in order to pack, paint and clean. I am now connected to these sweet roots and must grieve the loss of my beautiful little townhouse tucked behind a fast-food chain where I can hear sirens all day and all night. I must grieve the fact that I have to go to a different grocery store and get to know a new neighborhood. My daily walks will be on a different path and I will have to say goodbye to my local coffee shop baristas. I have spent so much of my life avoiding this suffering and avoiding saying goodbye, but to honor the goodness that this house has brought me, I must suffer the loss.</p><p>As I suffer the loss, new roots will be able to grow and my heart will be open to my new life.  It is a strange dichotomy to know I have to grieve and suffer loss in order to find new life. My instinct is to cover my eyes, ignore the heartache and focus on decorating my new space in my mind. But instead, I must welcome my sorrow and sit and stare at my empty walls with boxes stacked to the ceiling and smile with tears at the memories that are stirred.  I must stand in my doorway with my little boy in my arms, my husband by my side and my dog circling our feet, take a deep breath, let the tears come and say goodbye to my first home.</p><p style=\"text-align: center;\">__________________________________________________</p><p>Cathy Loerzel is the VP of Advancement of The Seattle School of Theology and Psychology and the Executive Director of The Allender Center. Cathy received her MA in Counseling Psychology from The Seattle School in 2007 and has been working with the school since graduation. She created The Allender Center along side of Dr. Allender and continues to invest as a teacher, group facilitator, and curriculum designer at the center. She also helped build The Seattle School Forum and The Leadership in the New Parish Certificate. Cathy is married to a local therapist, has a beautiful one-year-old son, and sweet old dog named Gizmo.</p><p>&nbsp;</p></div>",
		"url": "https://theallendercenter.org/2014/12/moving-grief/"
	}
]
